#-*- coding: utf-8 -*-
# @Time    : 2018/4/10 17:52
# @File    : data_generater.py
# @Author  : 守望@天空~
import random
from random import randint, choice
from datetime import date,datetime
from datetime import timedelta
import math
import types
import re
from faker import Faker
faker_cn = Faker('zh_CN')
faker_en = Faker('en')


str_lower = 'abcdefghijklmnopqrstuvwxyz'
str_upper = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
str_number = '0123456789'
str_symbol = '!@#$%^&*()[]《》吗，。、；‘’-=、—+'
# 百家姓
baijia = u'赵,钱,孙,李,周,吴,郑,王,冯,陈,楮,卫,蒋,沈,韩,杨,朱,秦,尤,许,何,吕,施,张,孔,曹,严,华,金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,奚,范,彭,郎,鲁,韦,昌,马,苗,凤,花,方,俞,任,袁,柳,酆,鲍,史,唐,费,廉,岑,薛,雷,贺,倪,汤,滕,殷,罗,毕,郝,邬,安,常,乐,于,时,傅,皮,卞,齐,康,伍,余,元,卜,顾,孟,平,黄,和,穆,萧,尹,姚,邵,湛,汪,祁,毛,禹,狄,米,贝,明,臧,计,伏,成,戴,谈,宋,茅,庞,熊,纪,舒,屈,项,祝,董,梁,杜,阮,蓝,闽,席,季,麻,强,贾,路,娄,危,江,童,颜,郭,梅,盛,林,刁,锺,徐,丘,骆,高,夏,蔡,田,樊,胡,凌,霍,虞,万,支,柯,昝,管,卢,莫,经,房,裘,缪,干,解,应,宗,丁,宣,贲,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,程,嵇,邢,滑,裴,陆,荣,翁,荀,羊,於,惠,甄,麹,家,封,芮,羿,储,靳,汲,邴,糜,松,井,段,富,巫,乌,焦,巴,弓,牧,隗,山,谷,车,侯,宓,蓬,全,郗,班,仰,秋,仲,伊,宫,宁,仇,栾,暴,甘,斜,厉,戎,祖,武,符,刘,景,詹,束,龙,叶,幸,司,韶,郜,黎,蓟,薄,印,宿,白,怀,蒲,邰,从,鄂,索,咸,籍,赖,卓,蔺,屠,蒙,池,乔,阴,郁,胥,能,苍,双,闻,莘,党,翟,谭,贡,劳,逄,姬,申,扶,堵,冉,宰,郦,雍,郤,璩,桑,桂,濮,牛,寿,通,边,扈,燕,冀,郏,浦,尚,农,温,别,庄,晏,柴,瞿,阎,充,慕,连,茹,习,宦,艾,鱼,容,向,古,易,慎,戈,廖,庾,终,暨,居,衡,步,都,耿,满,弘,匡,国,文,寇,广,禄,阙,东,欧,殳,沃,利,蔚,越,夔,隆,师,巩,厍,聂,晁,勾,敖,融,冷,訾,辛,阚,那,简,饶,空,曾,毋,沙,乜,养,鞠,须,丰,巢,关,蒯,相,查,后,荆,红,游,竺,权,逑,盖,益,桓,公,万俟,司马,上官,欧阳,夏侯,诸葛,闻人,东方,赫连,皇甫,尉迟,公羊,澹台,公冶,宗政,濮阳,淳于,单于,太叔,申屠,公孙,仲孙,轩辕,令狐,锺离,宇文,长孙,慕容,鲜于,闾丘,司徒,司空,丌官,司寇,仉,督,子车,颛孙,端木,巫马,公西,漆雕,乐正,壤驷,公良,拓拔,夹谷,宰父,谷梁,晋,楚,阎,法,汝,鄢,涂,钦,段干,百里,东郭,南门,呼延,归,海,羊舌,微生,岳,帅,缑,亢,况,后,有,琴,梁丘,左丘,东门,西门,商,牟,佘,佴,伯,赏,南宫,墨,哈,谯,笪,年,爱,阳,佟,第五,言,福'
# 常用名
names = [u"嘉", u"琼", u"桂", u"娣", u"叶", u"璧", u"璐", u"娅", u"琦", u"晶", u"妍", u"茜", u"秋", u"珊", u"莎", u"锦", u"黛", u"青",
         u"倩", u"婷", u"姣", u"婉", u"娴", u"瑾", u"颖", u"露", u"瑶", u"怡", u"婵", u"雁", u"蓓", u"纨", u"仪", u"荷", u"丹", u"蓉",
         u"眉", u"君", u"琴", u"蕊", u"薇", u"菁", u"梦", u"岚", u"苑", u"婕", u"馨", u"瑗", u"琰", u"韵", u"融", u"园", u"艺", u"咏",
         u"卿", u"聪", u"澜", u"纯", u"毓", u"悦", u"昭", u"冰", u"爽", u"琬", u"茗", u"羽", u"希", u"宁", u"欣", u"飘", u"育", u"滢",
         u"馥", u"筠", u"柔", u"竹", u"霭", u"凝", u"晓", u"欢", u"霄", u"枫", u"芸", u"菲", u"寒", u"伊", u"亚", u"宜", u"可", u"姬",
         u"舒", u"影", u"荔", u"枝", u"思", u"丽", u"秀", u"娟", u"英", u"华", u"慧", u"巧", u"美", u"娜", u"静", u"淑", u"惠", u"珠",
         u"翠", u"雅", u"芝", u"玉", u"萍", u"红", u"娥", u"玲", u"芬", u"芳", u"燕", u"彩", u"春", u"菊", u"勤", u"珍", u"贞", u"莉",
         u"兰", u"凤", u"洁", u"梅", u"琳", u"素", u"云", u"莲", u"真", u"环", u"雪", u"荣", u"爱", u"妹", u"霞", u"香", u"月", u"莺",
         u"媛", u"艳", u"瑞", u"凡", u"佳", u"涛", u"昌", u"进", u"林", u"有", u"坚", u"和", u"彪", u"博", u"诚", u"先", u"敬", u"震",
         u"振", u"壮", u"会", u"群", u"豪", u"心", u"邦", u"承", u"乐", u"绍", u"功", u"松", u"善", u"厚", u"庆", u"磊", u"民", u"友",
         u"裕", u"河", u"哲", u"江", u"超", u"浩", u"亮", u"政", u"谦", u"亨", u"奇", u"固", u"之", u"轮", u"翰", u"朗", u"伯", u"宏",
         u"言", u"若", u"鸣", u"朋", u"斌", u"梁", u"栋", u"维", u"启", u"克", u"伦", u"翔", u"旭", u"鹏", u"泽", u"晨", u"辰", u"士",
         u"以", u"建", u"家", u"致", u"树", u"炎", u"德", u"行", u"时", u"泰", u"盛", u"雄", u"琛", u"钧", u"冠", u"策", u"腾", u"伟",
         u"刚", u"勇", u"毅", u"俊", u"峰", u"强", u"军", u"平", u"保", u"东", u"文", u"辉", u"力", u"明", u"永", u"健", u"世", u"广",
         u"志", u"义", u"兴", u"良", u"海", u"山", u"仁", u"波", u"宁", u"贵", u"福", u"生", u"龙", u"元", u"全", u"国", u"胜", u"学",
         u"祥", u"才", u"发", u"成", u"康", u"星", u"光", u"天", u"达", u"安", u"岩", u"中", u"茂", u"武", u"新", u"利", u"清", u"飞",
         u"彬", u"富", u"顺", u"信", u"子", u"杰", u"楠", u"榕", u"风", u"航", u"弘", u"嘉赐", u"嘉容", u"嘉勋", u"宾鸿", u"宾实", u"彬彬",
         u"彬炳", u"彬郁", u"斌斌", u"斌蔚", u"滨海", u"波光", u"波鸿", u"波峻", u"博瀚", u"博超", u"博达", u"博厚", u"博简", u"博明", u"博容", u"博赡",
         u"博涉", u"博实", u"博涛", u"博学", u"博雅", u"博延", u"博艺", u"博易", u"博裕", u"博远", u"才良", u"成双", u"承基", u"承载", u"才艺", u"成天",
         u"承教", u"承泽", u"才英", u"才哲", u"才俊", u"成和", u"成弘", u"成化", u"成济", u"成礼", u"成龙", u"成文", u"成业", u"成益", u"成荫", u"成周",
         u"承安", u"承弼", u"承德", u"承恩", u"承平", u"承嗣", u"承天", u"承望", u"承宣", u"承颜", u"承业", u"承悦", u"承允", u"承志", u"德海", u"德厚",
         u"德华", u"德辉", u"德惠", u"德容", u"德润", u"德寿", u"德水", u"德馨", u"德曜", u"德义", u"德庸", u"德佑", u"德宇", u"德元", u"德运", u"德泽",
         u"德明", u"飞白", u"飞飙", u"飞掣", u"飞尘", u"飞沉", u"飞驰", u"飞光", u"飞翰", u"飞航", u"飞翮", u"飞鸿", u"飞捷", u"飞龙", u"飞鸾", u"飞鸣",
         u"飞鹏", u"飞扬", u"飞文", u"飞翔", u"飞星", u"飞翼", u"飞英", u"飞羽", u"飞雨", u"飞语", u"飞跃", u"飞章", u"飞舟", u"风华", u"丰茂", u"丰羽",
         u"刚洁", u"高峯", u"高旻", u"高原", u"光启", u"晗日", u"涵映", u"翰藻", u"昊英", u"浩慨", u"浩言", u"和惬", u"和玉", u"弘光", u"弘文", u"宏博",
         u"宏朗", u"宏逸", u"鸿德", u"鸿轩", u"鸿卓", u"华美", u"刚捷", u"高峰", u"高明", u"高远", u"光熙", u"涵畅", u"涵育", u"瀚海", u"浩波", u"浩旷",
         u"皓轩", u"和顺", u"和裕", u"弘和", u"弘新", u"宏才", u"宏茂", u"宏毅", u"鸿飞", u"鸿煊", u"华奥", u"华清", u"刚毅", u"高歌", u"高爽", u"高韵",
         u"光耀", u"涵涤", u"翰采", u"瀚漠", u"浩博", u"浩阔", u"和蔼", u"和硕", u"和豫", u"弘厚", u"弘雅", u"宏畅", u"宏邈", u"宏远", u"鸿风", u"鸿煊",
         u"华采", u"华荣", u"高昂", u"高格", u"高兴", u"高卓", u"光誉", u"涵亮", u"翰池", u"昊苍", u"浩初", u"浩漫", u"和安", u"和颂", u"和悦", u"弘化",
         u"弘扬", u"宏达", u"宏儒", u"宏壮", u"鸿福", u"鸿雪", u"华彩", u"华容", u"高岑", u"高寒", u"高轩", u"光赫", u"光远", u"涵忍", u"翰飞", u"昊昊",
         u"浩大", u"浩淼", u"和璧", u"和泰", u"和韵", u"弘济", u"弘业", u"宏大", u"宏深", u"鸿宝", u"鸿光", u"鸿羽", u"华灿", u"高畅", u"高翰", u"高雅",
         u"光华", u"国安", u"涵容", u"翰海", u"昊空", u"浩宕", u"浩渺", u"和昶", u"和悌", u"和泽", u"弘阔", u"弘义", u"宏放", u"宏胜", u"鸿波", u"鸿晖",
         u"鸿远", u"华藏", u"高超", u"高杰", u"高扬", u"光辉", u"国兴", u"涵润", u"翰翮", u"昊乾", u"浩荡", u"浩邈", u"和畅", u"和通", u"和正", u"弘亮",
         u"弘益", u"宏富", u"宏盛", u"鸿博", u"鸿朗", u"鸿云", u"华池", u"高驰", u"高洁", u"高阳", u"光济", u"国源", u"涵涵", u"翰林", u"昊穹", u"浩歌",
         u"浩气", u"和风", u"和同", u"和志", u"弘量", u"弘毅", u"宏峻", u"宏爽", u"鸿才", u"鸿文", u"鸿运", u"华翰", u"高达", u"高峻", u"高义", u"光霁",
         u"冠宇", u"涵煦", u"翰墨", u"昊然", u"浩广", u"浩然", u"和歌", u"和煦", u"鹤轩", u"弘深", u"弘懿", u"宏浚", u"宏硕", u"鸿彩", u"鸿熙", u"鸿哲",
         u"华皓", u"高澹", u"高朗", u"高谊", u"光亮", u"冠玉", u"涵蓄", u"翰学", u"昊然", u"浩涆", u"浩穰", u"和光", u"和雅", u"弘博", u"弘盛", u"弘致",
         u"宏恺", u"宏伟", u"鸿畅", u"鸿羲", u"鸿祯", u"华晖", u"高飞", u"高丽", u"高逸", u"光临", u"涵衍", u"翰音", u"昊天", u"浩瀚", u"浩壤", u"和平",
         u"和宜", u"弘大", u"弘图", u"弘壮", u"宏旷", u"宏扬", u"鸿畴", u"鸿禧", u"鸿振", u"华辉", u"嘉德", u"嘉福", u"嘉良", u"嘉茂", u"嘉木", u"嘉慕",
         u"嘉纳", u"嘉年", u"嘉平", u"嘉庆", u"嘉荣", u"嘉瑞", u"嘉胜", u"嘉石", u"嘉实", u"嘉树", u"嘉澍", u"嘉熙", u"嘉禧", u"嘉祥", u"嘉歆", u"嘉许",
         u"嘉言", u"嘉谊", u"嘉懿", u"嘉颖", u"嘉佑", u"嘉玉", u"嘉誉", u"嘉悦", u"嘉运", u"嘉泽", u"嘉珍", u"嘉祯", u"建弼", u"建章", u"经纬", u"景山",
         u"俊才", u"俊郎", u"俊爽", u"俊誉", u"开畅", u"凯捷", u"康复", u"乐安", u"乐水", u"乐悦", u"力言", u"良畴", u"茂才", u"敏学", u"明轩", u"朋兴",
         u"鹏飞", u"濮存", u"奇略", u"奇志", u"荣轩", u"锐泽", u"睿广", u"绍辉", u"斯年", u"泰初", u"天干", u"天逸", u"同济", u"巍昂", u"嘉志", u"建德",
         u"建中", u"经武", u"景胜", u"俊材", u"俊力", u"俊悟", u"俊远", u"嘉致", u"建华", u"健柏", u"经业", u"景铄", u"俊驰", u"俊良", u"俊晤", u"俊哲",
         u"坚白", u"建明", u"金鑫", u"经义", u"景天", u"俊楚", u"俊迈", u"俊侠", u"俊喆", u"坚壁", u"建茗", u"锦程", u"经艺", u"景同", u"俊达", u"俊茂",
         u"俊贤", u"俊智", u"坚秉", u"建木", u"瑾瑜", u"景澄", u"景曜", u"俊德", u"俊美", u"俊雄", u"峻熙", u"坚成", u"建树", u"晋鹏", u"景福", u"靖琪",
         u"俊发", u"俊民", u"俊雅", u"季萌", u"坚诚", u"建同", u"经赋", u"景焕", u"君昊", u"俊风", u"俊名", u"俊彦", u"季同", u"建安", u"建修", u"经亘",
         u"景辉", u"君浩", u"俊豪", u"俊明", u"俊逸", u"建白", u"建业", u"经国", u"景辉", u"俊艾", u"俊健", u"俊楠", u"俊英", u"建柏", u"建义", u"经略",
         u"景龙", u"俊拔", u"俊杰", u"俊能", u"俊友", u"建本", u"建元", u"经纶", u"景明", u"俊弼", u"俊捷", u"俊人", u"俊语", u"开诚", u"开宇", u"开济",
         u"开霁", u"开朗", u"凯安", u"凯唱", u"凯定", u"凯风", u"凯复", u"凯歌", u"凯凯", u"凯康", u"凯乐", u"凯旋", u"凯泽", u"恺歌", u"恺乐", u"康安",
         u"康伯", u"康成", u"康德", u"康健", u"康乐", u"康宁", u"康平", u"康胜", u"康盛", u"康时", u"康适", u"康顺", u"康泰", u"康裕", u"乐邦", u"乐天",
         u"乐湛", u"立诚", u"良工", u"乐成", u"乐童", u"乐章", u"立果", u"良翰", u"乐池", u"乐贤", u"乐正", u"立人", u"良吉", u"乐和", u"乐心", u"乐志",
         u"立辉", u"良骥", u"乐家", u"乐欣", u"黎昕", u"立轩", u"良俊", u"乐康", u"乐逸", u"黎明", u"立群", u"良骏", u"乐人", u"乐意", u"力夫", u"良奥",
         u"良朋", u"乐容", u"乐音", u"力强", u"良弼", u"良平", u"乐山", u"乐咏", u"力勤", u"良才", u"良哲", u"乐生", u"乐游", u"力行", u"良材", u"理群",
         u"乐圣", u"乐语", u"力学", u"良策", u"理全", u"茂材", u"茂德", u"茂典", u"茂实", u"茂学", u"茂勋", u"茂彦", u"敏博", u"敏才", u"敏达", u"敏睿",
         u"敏智", u"明诚", u"明达", u"明德", u"明辉", u"明杰", u"明俊", u"明朗", u"明亮", u"明旭", u"明煦", u"明远", u"明哲", u"明喆", u"明知", u"明志",
         u"明智", u"明珠", u"朋义", u"彭勃", u"彭薄", u"彭湃", u"彭彭", u"彭魄", u"彭越", u"彭泽", u"彭祖", u"鹏程", u"鹏池", u"鹏赋", u"鹏海", u"鹏鲸",
         u"鹏举", u"鹏鹍", u"鹏鲲", u"鹏涛", u"鹏天", u"鹏翼", u"鹏云", u"鹏运", u"溥心", u"璞玉", u"璞瑜", u"浦和", u"浦泽", u"奇迈", u"奇胜", u"奇水",
         u"奇思", u"奇邃", u"奇伟", u"奇玮", u"奇文", u"奇希", u"奇逸", u"奇正", u"奇致", u"祺福", u"祺然", u"祺祥", u"祺瑞", u"琪睿", u"庆生", u"锐达",
         u"锐锋", u"锐翰", u"锐进", u"锐精", u"锐立", u"锐利", u"锐思", u"锐逸", u"锐意", u"锐藻", u"锐阵", u"锐志", u"锐智", u"睿博", u"睿才", u"睿诚",
         u"睿慈", u"睿聪", u"睿达", u"睿德", u"睿范", u"睿好", u"睿明", u"睿识", u"睿思", u"绍钧", u"绍祺", u"绍元", u"升荣", u"圣杰", u"晟睿", u"思聪",
         u"思淼", u"思源", u"思远", u"思博", u"斯伯", u"泰和", u"泰河", u"泰鸿", u"泰华", u"泰宁", u"泰平", u"泰清", u"泰然", u"天材", u"天成", u"天赋",
         u"天罡", u"天工", u"天翰", u"天和", u"天华", u"天骄", u"天空", u"天禄", u"天路", u"天瑞", u"天睿", u"天佑", u"天宇", u"天元", u"天韵", u"天泽",
         u"天纵", u"同方", u"同甫", u"同光", u"同和", u"同化", u"巍然", u"巍奕", u"伟博", u"伟毅", u"伟才", u"伟诚", u"伟茂", u"伟懋", u"伟祺", u"伟彦",
         u"伟晔", u"伟泽", u"文德", u"文山", u"向晨", u"心思", u"新觉", u"兴朝", u"兴文", u"星汉", u"星渊", u"修然", u"学博", u"雅昶", u"阳冰", u"阳舒",
         u"阳泽", u"毅然", u"意致", u"英华", u"英耀", u"永昌", u"永言", u"勇毅", u"玉宸", u"玉泽", u"元良", u"远航", u"伟兆", u"伟志", u"温纶", u"温茂",
         u"温书", u"温韦", u"温文", u"温瑜", u"文柏", u"文昌", u"文成", u"文栋", u"文赋", u"文光", u"文翰", u"文虹", u"文华", u"文康", u"文乐", u"文林",
         u"文敏", u"文瑞", u"文石", u"文星", u"文轩", u"文宣", u"文彦", u"文曜", u"文耀", u"文斌", u"文彬", u"文滨", u"向笛", u"心远", u"新立", u"兴德",
         u"兴贤", u"星河", u"星洲", u"修为", u"学海", u"雅畅", u"阳波", u"阳朔", u"阳州", u"逸仙", u"意智", u"英杰", u"英奕", u"永长", u"永逸", u"宇达",
         u"玉成", u"煜祺", u"元亮", u"苑博", u"向文", u"欣德", u"新荣", u"兴发", u"兴修", u"星华", u"修诚", u"修伟", u"学林", u"雅达", u"阳伯", u"阳文",
         u"烨赫", u"逸明", u"熠彤", u"英朗", u"英逸", u"永丰", u"永元", u"宇航", u"玉龙", u"元白", u"元龙", u"苑杰", u"向明", u"欣嘉", u"新知", u"兴国",
         u"兴学", u"星晖", u"修德", u"修文", u"学民", u"雅惠", u"阳成", u"阳曦", u"烨华", u"逸春", u"懿轩", u"英锐", u"英毅", u"永福", u"永贞", u"宇寰",
         u"玉泉", u"元德", u"元明", u"越彬", u"向荣", u"欣可", u"信鸿", u"兴怀", u"兴言", u"星火", u"修杰", u"修雅", u"学名", u"雅健", u"阳德", u"阳夏",
         u"烨磊", u"宜春", u"英飙", u"英睿", u"英哲", u"永嘉", u"咏德", u"宇文", u"玉山", u"元化", u"元青", u"蕴涵", u"向阳", u"欣然", u"信厚", u"兴平",
         u"兴业", u"星剑", u"修洁", u"修永", u"学文", u"雅珺", u"阳华", u"阳旭", u"烨霖", u"宜民", u"英博", u"英睿", u"英喆", u"永康", u"咏歌", u"宇荫",
         u"玉石", u"元基", u"元思", u"蕴和", u"翔宇", u"欣荣", u"信鸥", u"兴庆", u"兴运", u"星津", u"修谨", u"修远", u"学义", u"雅逸", u"阳晖", u"阳煦",
         u"烨然", u"宜年", u"英才", u"英韶", u"英卓", u"永年", u"咏思", u"雨伯", u"玉书", u"元嘉", u"元纬", u"蕴藉", u"翔飞", u"欣怡", u"信然", u"兴生",
         u"星波", u"星阑", u"修筠", u"修真", u"学真", u"雅懿", u"阳辉", u"阳炎", u"烨烁", u"宜然", u"英达", u"英卫", u"英资", u"永宁", u"咏志", u"雨华",
         u"玉树", u"元甲", u"元武", u"项禹", u"欣怿", u"信瑞", u"兴思", u"星辰", u"星纬", u"修明", u"修竹", u"雪松", u"雅志", u"阳嘉", u"阳焱", u"烨伟",
         u"宜人", u"英发", u"英武", u"英纵", u"永寿", u"勇男", u"雨石", u"玉堂", u"元驹", u"元勋", u"项明", u"欣悦", u"兴安", u"兴腾", u"星驰", u"星文",
         u"修能", u"修贤", u"雪峰", u"炎彬", u"阳平", u"阳曜", u"烨烨", u"宜修", u"英范", u"英悟", u"永怡", u"永思", u"勇军", u"雨信", u"玉轩", u"元凯",
         u"元正", u"晓博", u"新翰", u"兴邦", u"兴旺", u"星光", u"星宇", u"修平", u"旭尧", u"雪风", u"阳飙", u"阳秋", u"阳羽", u"烨熠", u"意远", u"英光",
         u"英勋", u"永春", u"永望", u"勇捷", u"雨星", u"玉宇", u"元恺", u"元忠", u"心水", u"新霁", u"兴昌", u"兴为", u"星海", u"星雨", u"修齐", u"炫明",
         u"阳飇", u"阳荣", u"阳云", u"烨煜", u"意蕴", u"英豪", u"英彦", u"永安", u"永新", u"勇锐", u"雨泽", u"玉韵", u"元魁", u"元洲", u"展鹏", u"哲瀚",
         u"哲茂", u"哲圣", u"哲彦", u"振海", u"振国", u"正诚", u"正初", u"正德", u"正浩", u"正豪", u"正平", u"正奇", u"正青", u"正卿", u"正文", u"正祥",
         u"正信", u"正雅", u"正阳", u"正业", u"正谊", u"正真", u"正志", u"志诚", u"志新", u"志勇", u"志明", u"志国", u"志强", u"志尚", u"志专", u"志文",
         u"志行", u"志学", u"志业", u"志义", u"志用", u"志泽", u"致远", u"智明", u"智鑫", u"智勇", u"智敏", u"智志", u"智渊", u"子安", u"子晋", u"子民",
         u"子明", u"子默", u"子墨", u"子平", u"子琪", u"子石", u"子实", u"子真", u"子濯", u"子昂", u"子轩", u"子瑜", u"自明", u"自强", u"作人", u"自怡",
         u"自珍", u"曾琪", u"泽宇", u"泽语", u"昊天", u"思聪", u"展鹏", u"笑愚", u"志强", u"炫明", u"雪松", u"思源", u"智渊", u"思淼", u"晓啸", u"天宇",
         u"浩然", u"文轩", u"鹭洋", u"振家", u"乐驹", u"晓博", u"文博", u"昊焱", u"立果", u"金鑫", u"锦程", u"嘉熙", u"鹏飞", u"子默", u"思远", u"浩轩",
         u"语堂", u"聪健", u"博琛", u"博尘", u"博晨", u"博城", u"博杰", u"博琨", u"博雷", u"博诗", u"博石", u"博思", u"博坛", u"博坦", u"博韦", u"博唯",
         u"博询", u"博垚", u"博虞", u"博俣", u"博袁", u"搏尘", u"搏雷", u"偲琦", u"偲祺", u"才锋", u"财林", u"采君", u"彩城", u"彩飞", u"昌臣", u"昌赫",
         u"昌珏", u"昌俊", u"昌生", u"昌晟", u"长斌", u"长稳", u"长毅", u"常醇", u"常齐", u"常澍", u"嫦曦", u"昶辰", u"朝训", u"朝宇", u"朝正", u"朝政",
         u"彻恒", u"彻衡", u"彻时", u"辰奕", u"辰泽", u"陈果", u"陈瑞", u"陈泽", u"宸好", u"宸鬟", u"晨明", u"晨伟", u"晨玮", u"晨兴", u"丞浩", u"丞鸿",
         u"成发", u"成揽", u"成缆", u"成男", u"成瑞", u"成岩", u"呈鸿", u"呈滟", u"城鸿", u"城澜", u"城斓", u"城泰", u"城轩", u"城羽", u"乘鸿", u"础硕",
         u"础运", u"楚巴", u"楚含", u"楚馨", u"川驰", u"川川", u"创业", u"春岸", u"春才", u"春地", u"春弟", u"春娣", u"春瑰", u"春露", u"春媚", u"春宓",
         u"春秒", u"春妙", u"春茗", u"春培", u"春元", u"春圆", u"春缘", u"纯宁", u"纯生", u"纯烁", u"纯鸶", u"聪沛", u"聪佩", u"聪霈", u"聪橼", u"翠干",
         u"存轲", u"达鸿", u"黛滢", u"丹帆", u"丹曦", u"党泽", u"道城", u"道顺", u"道逸", u"德热", u"德澍", u"德堂", u"德亭", u"德仙", u"德彦", u"德政",
         u"笛扬", u"弟明", u"第中", u"典伍", u"殿杰", u"丁粲", u"丁鲚", u"丢丢", u"东昂", u"东宝", u"东兵", u"东呈", u"东初", u"东蘅", u"东卫", u"冬平",
         u"冬松", u"冬隹", u"笃超", u"度君", u"多铎", u"恩姝", u"恩澍", u"恩廷", u"恩亭", u"恩庭", u"恩炜", u"恩玺", u"发智", u"帆洲", u"凡迪", u"凡光",
         u"凡希", u"凡想", u"凡星", u"芳吉", u"芳莲", u"芳林", u"芳黔", u"芳言", u"芳毅", u"芳影", u"丰燃", u"丰翼", u"丰吟", u"丰毓", u"风下", u"沣樟",
         u"枫桥", u"凤梁", u"凤楠", u"凤平", u"凤苹", u"凤强", u"凤阳", u"凤徉", u"蚨弘", u"涪立", u"福安", u"福昊", u"福金", u"福军", u"福录", u"富良",
         u"富瑞", u"馥羡", u"伽宝", u"伽祺", u"伽鑫", u"伽瑜", u"格辛", u"根峰", u"根康", u"根全", u"耿晨", u"耿良", u"功林", u"冠生", u"冠智", u"光兵",
         u"光航", u"光俊", u"光峻", u"光良", u"广顺", u"广拓", u"广鑫", u"贵莲", u"贵水", u"桂波", u"桂甫", u"国乒", u"国评", u"国凭", u"国苹", u"国屏",
         u"国瓶", u"国谦", u"海菲", u"海沣", u"海枫", u"海宽", u"海珊", u"海腾", u"海为", u"函名", u"函睿", u"函偌", u"函伊", u"函恣", u"晗梦", u"晗羿",
         u"翰骉", u"翰名", u"翰乡", u"瀚莆", u"瀚祺", u"航歌", u"航岐", u"好阳", u"昊聪", u"昊澜", u"昊芃", u"昊泉", u"昊儒", u"昊通", u"博名", u"博维",
         u"搏易", u"彩君", u"长成", u"昶余", u"掣龙", u"宸林", u"成关", u"承翰", u"程鸿", u"川瀚", u"春合", u"春沛", u"纯泽", u"达军", u"锝伽", u"德枝",
         u"丁维", u"东静", u"多平", u"恩岩", u"凡越", u"昉育", u"枫驿", u"凤哲", u"福瑞", u"伽羽", u"狗狗", u"光时", u"桂娇", u"国全", u"海伟", u"涵铄",
         u"航伸", u"昊析", u"博明", u"博纬", u"卜硕", u"彩平", u"长舂", u"昶昀", u"琛岩", u"宸宁", u"成宏", u"承鸿", u"程明", u"川望", u"春弘", u"春朋",
         u"莼宁", u"达良", u"锝枷", u"的伽", u"丁洋", u"东篱", u"铎辉", u"恩印", u"矾耘", u"舫中", u"峰辰", u"凤珠", u"福永", u"改利", u"咕咚", u"光贤",
         u"桂梨", u"国松", u"海永", u"涵余", u"航旭", u"昊晰", u"博茗", u"博炜", u"卜鸶", u"彩香", u"长歌", u"玚昭", u"琛雨", u"宸骐", u"成栏", u"承杰",
         u"程瑗", u"川子", u"春虎", u"春乒", u"淳厚", u"达仁", u"锝家", u"的加", u"顶山", u"东霖", u"铎明", u"恩佑", u"梵宇", u"飞伯", u"峰平", u"俸昌",
         u"甫壮", u"纲正", u"固源", u"光逸", u"桂良", u"国仙", u"海钰", u"涵章", u"航岩", u"浩昂", u"博铭", u"博雯", u"不惑", u"睬铄", u"长鸿", u"畅苡",
         u"尘君", u"宸榕", u"成阑", u"承沛", u"逞鸿", u"传财", u"春建", u"春然", u"淳朴", u"达熹", u"锝稼", u"的佳", u"顶天", u"东鹭", u"铎炎", u"而雅",
         u"方辉", u"飞麟", u"峰奇", u"俸好", u"辅奎", u"高树", u"顾依", u"光跃", u"桂容", u"国欣", u"海源", u"寒乐", u"航舟", u"浩长", u"博酩", u"博夕",
         u"不忧", u"灿琦", u"长菊", u"超盈", u"臣旭", u"宸语", u"成蓝", u"承荣", u"弛宇", u"传进", u"春婕", u"春亭", u"祠言", u"达秀", u"锝茄", u"的家",
         u"鼎天", u"东其", u"恩谨", u"二波", u"方龙", u"飞荣", u"峰顺", u"夫生", u"付靖", u"高喜", u"观君", u"光真", u"桂卮", u"国杏", u"亥涛", u"寒铄",
         u"豪宇", u"浩驰", u"博男", u"博希", u"步兵", u"璨祎", u"长君", u"朝臣", u"忱忱", u"宸竹", u"成谰", u"承武", u"驰远", u"传君", u"春力", u"春望",
         u"慈昕", u"大奖", u"德宾", u"的嘉", u"鼎新", u"东芮", u"恩蕊", u"二根", u"方黔", u"飞言", u"峰勇", u"夫子", u"付军", u"高岩", u"观朋", u"广宾",
         u"桂栀", u"国岩", u"亥滔", u"汉乘", u"濠骉", u"浩凡", u"博启", u"博详", u"偲恺", u"仓祥", u"长岭", u"朝戈", u"忱晨", u"晨豪", u"成澜", u"承泽",
         u"崇敏", u"传平", u"春立", u"春侠", u"聪海", u"大尉", u"德根", u"的稼", u"定伟", u"东锐", u"恩芮", u"二好", u"方淅", u"菲雨", u"峰周", u"鄜竣",
         u"付琦", u"阁生", u"冠国", u"广财", u"桂竹", u"果然", u"亥韬", u"汉春", u"濠德", u"浩颉", u"博谦", u"博祥", u"偲诺", u"岑竺", u"长秋", u"朝汉",
         u"辰虹", u"晨皓", u"成篮", u"诚懿", u"崇香", u"传奇", u"春良", u"春霄", u"聪觉", u"大茵", u"德嘉", u"灯震", u"定炜", u"东瑞", u"恩瑞", u"二乐",
         u"方泽", u"翡翠", u"凤凤", u"扶民", u"付彦", u"格非", u"冠茗", u"广敏", u"国利", u"海柏", u"骇涛", u"汉伟", u"濠宇", u"浩岭", u"博师", u"博栩",
         u"偲骐", u"禅想", u"长珊", u"朝帅", u"辰伟", u"晨惠", u"成览", u"城弘", u"初泽", u"传岳", u"春泠", u"春盈", u"聪栊", u"戴安", u"德科", u"迪慧",
         u"定玮", u"东朔", u"恩睿", u"发瑞", u"芳畅", u"丰磊", u"凤环", u"芙冰", u"富金", u"格良", u"冠群", u"广鹏", u"国名", u"海标", u"函冰", u"琀璐",
         u"好棋", u"浩名", u"浩鸣", u"皓瑜", u"贺影", u"红来", u"泓轩", u"洪芝", u"华睿", u"怀宇", u"晖泽", u"慧贞", u"济仁", u"加弦", u"佳楣", u"珈成",
         u"家善", u"家邑", u"嘉聆", u"稼睿", u"建影", u"鉴豪", u"杰卿", u"金玛", u"金樱", u"锦田", u"缙睿", u"井奎", u"敬发", u"静若", u"聚明", u"俊航",
         u"俊弋", u"骏泽", u"苛萌", u"克极", u"焜羽", u"乐琨", u"力糊", u"立珍", u"栎琨", u"潋潋", u"林莽", u"令清", u"潞仪", u"伦福", u"浩石", u"皓元",
         u"赫洋", u"红恋", u"泓研", u"虹玮", u"华山", u"怀雨", u"汇敏", u"伙辉", u"济事", u"加鑫", u"佳能", u"珈诚", u"家声", u"家懿", u"嘉亓", u"稼树",
         u"建尤", u"鉴华", u"杰斯", u"金蚂", u"金刖", u"锦杏", u"京朝", u"井烁", u"敬锋", u"静晓", u"军霄", u"俊葫", u"俊艺", u"珺赫", u"柯成", u"克雷",
         u"腊得", u"耒连", u"力箭", u"立柱", u"栎芘", u"良浩", u"林昕", u"留逢", u"璐琀", u"伦华", u"浩识", u"颢碧", u"赫宇", u"红旗", u"泓州", u"虹显",
         u"华涛", u"淮嘉", u"会波", u"霍霍", u"济洲", u"加彦", u"佳杞", u"珈珈", u"家胜", u"家盈", u"嘉祁", u"简答", u"建源", u"鉴贤", u"洁霖", u"金培",
         u"金珠", u"锦煊", u"京方", u"景珑", u"敬浩", u"静缢", u"军孝", u"俊惠", u"俊屹", u"珺伟", u"柯凡", u"克楠", u"兰均", u"离骚", u"力克", u"丽妃",
         u"郦君", u"良鸿", u"林焱", u"琉璃", u"璐佳", u"伦礼", u"浩通", u"颢天", u"亨瑞", u"红让", u"洪滨", u"虹宇", u"华希", u"欢昊", u"会长", u"吉丰",
         u"继辉", u"佳帮", u"佳润", u"珈宁", u"家盛", u"家永", u"嘉旗", u"简熙", u"建志", u"键民", u"洁石", u"金姗", u"津歌", u"劲川", u"京学", u"景隆",
         u"敬恒", u"静影", u"军周", u"俊逵", u"俊佚", u"开波", u"柯林", u"克荣", u"兰琪", u"骊君", u"力宽", u"丽兰", u"郦力", u"良厚", u"林耀", u"六平",
         u"璐杰", u"泺滢", u"浩同", u"颢彤", u"恒彬", u"红彦", u"洪成", u"鸿翰", u"华仙", u"欢华", u"会来", u"佶励", u"继宽", u"佳贝", u"佳铄", u"珈祺",
         u"家朔", u"家有", u"嘉谦", u"简怿", u"建仲", u"键敏", u"洁芸", u"金堂", u"津豪", u"劲节", u"京泽", u"景斯", u"敬宏", u"静语", u"君慧", u"俊领",
         u"俊妤", u"开渠", u"柯明", u"克田", u"兰钰", u"鹂力", u"力漫", u"丽志", u"郦芸", u"良良", u"林一", u"龙葵", u"璐瑾", u"洛兵", u"浩旭", u"颢碹",
         u"恒希", u"宏邦", u"洪程", u"鸿萌", u"华学", u"欢欣", u"会绵", u"棘茵", u"继领", u"佳畅", u"佳太", u"珈鑫", u"家铄", u"家妤", u"嘉泉", u"简子",
         u"建壮", u"江楠", u"捷希", u"金田", u"津利", u"进才", u"京增", u"景岩", u"敬久", u"静梓", u"君瑞", u"俊逯", u"俊云", u"开全", u"柯辛", u"克伟",
         u"岚潇", u"璃紫", u"力闻", u"利比", u"笠比", u"梁聪", u"林羽", u"泷泽", u"璐茗", u"瞒容", u"浩杨", u"颢宇", u"恒暄", u"宏昌", u"洪昊", u"鸿箐",
         u"华洋", u"欢馨", u"会青", u"集银", u"继秋", u"佳超", u"佳卫", u"珈月", u"家泰", u"家中", u"嘉如", u"建邦", u"剑海", u"江荣", u"藉泽", u"金停",
         u"津萌", u"进锋", u"惊语", u"景研", u"敬伟", u"镜驰", u"君霄", u"俊禄", u"俊州", u"开欣", u"柯炎", u"克杨", u"蓝键", u"黎敏", u"力溪", u"利妣",
         u"傈芘", u"粱田", u"林袁", u"栊远", u"璐希", u"满达", u"浩业", u"灏彤", u"恒一", u"宏广", u"洪来", u"鸿孺", u"骅鼐", u"环凤", u"会学", u"籍泽",
         u"继岳", u"佳丞", u"佳闻", u"家帮", u"家棠", u"葭琪", u"嘉燊", u"建虎", u"剑鸣", u"江夏", u"巾钰", u"金枉", u"津蒙", u"进省", u"旌丞", u"景圆",
         u"敬一", u"镜亘", u"均池", u"俊萁", u"俊孜", u"开轩", u"珂显", u"克真", u"览器", u"礼君", u"力勇", u"利彼", u"连彩", u"亮汐", u"麟仪", u"露希",
         u"璐晰", u"满莲", u"浩知", u"灏宇", u"恒彧", u"宏葵", u"洪朗", u"鸿涛", u"画林", u"环环", u"惠爱", u"纪胜", u"继钊", u"佳德", u"佳芯", u"家发",
         u"家葳", u"嘉斌", u"嘉晟", u"建均", u"剑庭", u"江永", u"金潮", u"金玺", u"津名", u"进鑫", u"菁莓", u"景峥", u"敬云", u"九八", u"均泽", u"俊闰",
         u"峻澜", u"开宣", u"珂易", u"克忠", u"朗昀", u"礼貌", u"力渔", u"利笔", u"连超", u"尥瞋", u"灵萸", u"露珠", u"璐阳", u"满罗", u"浩孜", u"合昌",
         u"恒岳", u"宏来", u"洪立", u"厚君", u"桦采", u"环康", u"惠函", u"纪彤", u"冀昕", u"佳朵", u"佳研", u"家帆", u"家雄", u"嘉博", u"嘉喜", u"建磊",
         u"健宾", u"江勇", u"金钏", u"金侠", u"谨睿", u"进彦", u"菁媚", u"憬峻", u"靓醴", u"九洲", u"钧星", u"俊肖", u"峻渺", u"开研", u"轲金", u"刻刻",
         u"老八", u"礼睿", u"立尔", u"利峰", u"莲莲", u"林飞", u"灵羽", u"鲁滨", u"璐伊", u"满堂", u"皓东", u"合恒", u"恒璋", u"宏力", u"洪令", u"厚仪",
         u"桦侣", u"鬟鬟", u"惠惠", u"纪筱", u"骥怀", u"佳蘅", u"佳扬", u"家福", u"家宣", u"嘉和", u"嘉娴", u"建鸣", u"健良", u"江云", u"金枸", u"金兴",
         u"谨嬴", u"晋睿", u"菁羽", u"憬龙", u"靖锋", u"掬青", u"筠玺", u"俊忻", u"峻缈", u"开运", u"可尔", u"恪良", u"老二", u"李峰", u"立果", u"利来",
         u"莲青", u"林岗", u"灵芸", u"陆菡", u"律霏", u"满香", u"皓峰", u"合军", u"恒卓", u"宏让", u"洪润", u"胡南", u"桦炎", u"幻儿", u"惠宁", u"纪攸",
         u"加慧", u"佳吉", u"佳肴", u"家珲", u"家萱", u"嘉迦", u"嘉绚", u"建任", u"健漫", u"江运", u"金净", u"金荀", u"锦怀", u"晋维", u"菁语", u"警予",
         u"靖桐", u"炬同", u"俊葆", u"俊芯", u"峻言", u"凯希", u"可杰", u"坤京", u"老九", u"李轩", u"立名", u"利芘", u"联军", u"林弘", u"凌铖", u"禄宇",
         u"律希", u"慢容", u"皓凯", u"和函", u"蘅樟", u"宏梧", u"洪田", u"湖兰", u"怀民", u"奂黛", u"惠云", u"纪游", u"加进", u"佳珈", u"佳愉", u"家骥",
         u"家漩", u"嘉珈", u"嘉延", u"建委", u"健弦", u"姣芮", u"金珏", u"金珧", u"锦绘", u"晋闻", u"晶波", u"竞楠", u"境铭", u"炬彤", u"俊苍", u"俊辛",
         u"峻漪", u"凯勋", u"可语", u"坤申", u"老六", u"力灞", u"立仁", u"利廷", u"廉义", u"林宏", u"凌菲", u"路明", u"率良", u"蔓君", u"皓龙", u"和群",
         u"弘力", u"宏仪", u"洪祥", u"华俭", u"怀铭", u"焕臣", u"慧丹", u"济沧", u"加明", u"佳晋", u"佳智", u"家珏", u"家训", u"嘉晋", u"嘉羽", u"建弦",
         u"健滢", u"娇芮", u"金崛", u"金益", u"锦恺", u"晋曦", u"晶采", u"竞岩", u"静晗", u"锯铭", u"俊岑", u"俊延", u"浚燠", u"恺人", u"克楚", u"坤硕",
         u"老三", u"力璁", u"立薇", u"俐江", u"炼雨", u"林君", u"凌智", u"路莎", u"绿波", u"猫猫", u"皓睿", u"河清", u"红昌", u"泓伶", u"洪业", u"华芹",
         u"怀若", u"焕言", u"慧华", u"济珲", u"加堂", u"佳棂", u"迦嘉", u"家名", u"家彦", u"嘉静", u"嘉缘", u"建行", u"鉴德", u"湫滢", u"金镭", u"金姻",
         u"锦绵", u"晋雍", u"精涵", u"竟秋", u"静枚", u"聚德", u"俊臣", u"俊严", u"骏伟", u"康哲", u"克翠", u"坤孝", u"老四", u"力蜚", u"立阳", u"俐潇",
         u"恋宸", u"林康", u"棂君", u"潞遐", u"鸾君", u"茂扬", u"皓石", u"荷群", u"红锋", u"泓潇", u"洪云", u"华群", u"怀湘", u"焕章", u"慧君", u"济然",
         u"加棠", u"佳满", u"迦鑫", u"家鹏", u"家以", u"嘉可", u"稼帮", u"建意", u"鉴峰", u"皆成", u"金李", u"金银", u"锦名", u"晋元", u"精力", u"竟尧",
         u"静柔", u"聚乱", u"俊罕", u"俊义", u"骏宇", u"抗抗", u"克晖", u"昆仑", u"老五", u"力刚", u"立泽", u"俪芸", u"楝雨", u"林凌", u"菱薇", u"潞邺",
         u"銮君", u"玫伶", u"湄义", u"孟雨", u"蜜哲", u"珉璐", u"明贵", u"鸣瑞", u"铭颀", u"墨霏", u"牧新", u"整理", u"培丞", u"沛桦", u"鹏图", u"栖梧",
         u"奇瑗", u"骐硕", u"旗峰", u"谦华", u"钦元", u"卿池", u"庆恩", u"全航", u"冉旭", u"任图", u"如涵", u"芮宇", u"瑞秀", u"睿棠", u"润升", u"若源",
         u"珊珅", u"少璨", u"绍德", u"生源", u"晟曦", u"诗能", u"史晖", u"士泽", u"世肖", u"首烜", u"淑帆", u"术敏", u"帅冰", u"水玻", u"美佳", u"梦慈",
         u"苗苯", u"珉烟", u"明翰", u"茗慧", u"铭琦", u"默石", u"慕子", u"南缨", u"培成", u"沛康", u"鹏远", u"栖炫", u"奇正", u"骐溪", u"麒炫", u"谦漠",
         u"钦政", u"卿宇", u"庆夫", u"全时", u"苒希", u"任一", u"如泉", u"瑞财", u"瑞严", u"睿雯", u"润胜", u"偌辉", u"善幻", u"少凤", u"绍华", u"声琪",
         u"晟先", u"诗睿", u"士渤", u"士璋", u"世远", u"书何", u"淑环", u"树峰", u"帅果", u"水贵", u"美迦", u"梦捷", u"淼磐", u"闽滇", u"明鸿", u"茗蔚",
         u"铭琪", u"默萱", u"那凡", u"南佑", u"培锋", u"沛轩", u"澎薇", u"期炫", u"祈涵", u"骐献", u"屺琅", u"谦润", u"秦欢", u"清石", u"庆鸿", u"全堂",
         u"人榜", u"日曦", u"如是", u"瑞迪", u"瑞彦", u"睿汶", u"润甜", u"三珊", u"善郡", u"少景", u"社富", u"胜然", u"盛凯", u"诗书", u"士菊", u"士子",
         u"仕赫", u"书樵", u"淑谨", u"树环", u"帅良", u"水群", u"美其", u"梦璐", u"淼逸", u"敏寒", u"明龙", u"茗祎", u"铭祺", u"默言", u"纳凡", u"南孜",
         u"培贵", u"沛余", u"澎玮", u"期彧", u"祈菡", u"骐语", u"启聪", u"谦澍", u"秦佳", u"清苇", u"庆汇", u"全致", u"人镵", u"荣凯", u"如泽", u"瑞恩",
         u"瑞扬", u"睿曦", u"润烟", u"三石", u"善利", u"少坤", u"社清", u"胜一", u"盛铭", u"诗枢", u"士里", u"世琛", u"仕嘉", u"书群", u"淑绵", u"树磊",
         u"帅鹏", u"水滢", u"美仁", u"梦青", u"淼茵", u"敏铃", u"明球", u"铭堡", u"铭麒", u"谋金", u"乃璁", u"廿九", u"培嘉", u"沛泽", u"圮然", u"祁兰",
         u"祈妙", u"骐源", u"启恩", u"谦松", u"秦眉", u"清炜", u"庆会", u"全众", u"人飞", u"荣克", u"孺鸿", u"瑞凤", u"瑞洋", u"睿婞", u"若华", u"三泽",
         u"善勋", u"少莲", u"涉浚", u"胜屹", u"盛堂", u"诗杨", u"士鸣", u"世东", u"仕品", u"书同", u"淑淼", u"树锁", u"帅强", u"顺枫", u"美曦", u"梦潇",
         u"妙妗", u"名昌", u"明山", u"铭城", u"铭坛", u"沐辰", u"乃友", u"念一", u"培江", u"沛峥", u"飘君", u"祁茵", u"颀菡", u"骐志", u"启民", u"谦中",
         u"秦湄", u"清玮", u"箐涛", u"权锋", u"人福", u"荣林", u"孺欢", u"瑞光", u"瑞毅", u"睿懿", u"若金", u"三赵", u"善云", u"少堂", u"申倮", u"笙良",
         u"盛天", u"诗伊", u"士旗", u"世繁", u"仕洋", u"书铜", u"淑容", u"树桐", u"帅堂", u"顺家", u"美子", u"萌萱", u"蒙萱", u"蒙渲", u"孟刚", u"孟纲",
         u"孟昊", u"孟琦", u"孟依", u"孟宇", u"梦语", u"梦云", u"米奥", u"米锋", u"米铃", u"宓飘", u"宓镶", u"密珠", u"蜜诗", u"蜜语", u"妙柯", u"妙可",
         u"妙雨", u"妙云", u"乜叆", u"民平", u"岷轩", u"旻旻", u"旻天", u"玟伶", u"名臣", u"名春", u"名复", u"名昊", u"名锟", u"名瑞", u"名衍", u"名泽",
         u"明晨", u"明聪", u"明升", u"明烁", u"明铄", u"明曦", u"明言", u"明伊", u"明莺", u"明舟", u"鸣坤", u"鸣锟", u"铭坫", u"铭冠", u"铭濠", u"铭佳",
         u"铭可", u"铭坤", u"铭锟", u"铭乐", u"铭林", u"铭其", u"铭夕", u"铭昔", u"铭晰", u"铭熙", u"铭玺", u"铭昕", u"铭垚", u"铭义", u"沫廷", u"墨菲",
         u"沐镪", u"沐强", u"沐羟", u"沐清", u"沐旸", u"沐塬", u"沐紫", u"牧春", u"牧秋", u"牧辛", u"乃泽", u"耐忠", u"南麟", u"南腩", u"南岐", u"南驿",
         u"念月", u"柠萱", u"泞菘", u"农泽", u"女皇", u"诺风", u"诺天", u"诺桐", u"欧洋", u"排骨", u"培利", u"培名", u"培容", u"培砚", u"培叶", u"培语",
         u"培育", u"培圆", u"培云", u"培珍", u"佩昕", u"佩欣", u"佩煜", u"佩泽", u"佩姿", u"霈林", u"朋超", u"朋朔", u"朋鑫", u"鹏骏", u"品硕", u"品卓",
         u"娉鹛", u"聘伟", u"平利", u"平苹", u"坪苹", u"苹苹", u"屏坚", u"七炫", u"齐炫", u"其彬", u"其威", u"其巍", u"其炫", u"其绚", u"其沅", u"其瑗",
         u"奇财", u"奇炫", u"淇岚", u"淇炫", u"骐铖", u"骐灏", u"骐珲", u"骐菁", u"骐恺", u"骐领", u"骐莆", u"骐箐", u"琦靖", u"琦崎", u"琦燊", u"琦炫",
         u"琦屿", u"琪诚", u"琪静", u"琪敏", u"琪瑗", u"祺靖", u"启青", u"启宣", u"起彦", u"千余", u"千语", u"千子", u"芊怿", u"谦成", u"谦达", u"谦浩",
         u"乾钟", u"强中", u"樵儿", u"巧利", u"巧萌", u"巧智", u"翘来", u"翘玮", u"锲舍", u"钦裕", u"秦粤", u"沁儿", u"沁馨", u"青帛", u"青的", u"青虹",
         u"青江", u"青蔚", u"青营", u"青与", u"清一", u"清乙", u"清友", u"清之", u"清中", u"情凡", u"情幻", u"情人", u"情月", u"庆超", u"罄烩", u"琼辉",
         u"邱华", u"秋波", u"秋瑾", u"秋棋", u"秋琪", u"秋硕", u"秋滢", u"曲波", u"权苇", u"权震", u"泉宏", u"泉辉", u"群娣", u"群书", u"群淑", u"燃狄",
         u"冉宁", u"冉棠", u"人合", u"人龙", u"人颅", u"人厅", u"仁博", u"仁峰", u"仁甫", u"任彪", u"任晶", u"任恋", u"荣庆", u"荣任", u"荣树", u"荣章",
         u"荣榛", u"容辉", u"容君", u"容杏", u"柔含", u"糅皓", u"孺生", u"入飞", u"入跞", u"入愿", u"朊司", u"蕊杰", u"蕊君", u"蕊幔", u"芮旗", u"芮瑜",
         u"瑞浩", u"瑞驹", u"瑞禄", u"瑞玫", u"瑞楣", u"瑞齐", u"瑞旗", u"瑞情", u"瑞山", u"瑞士", u"瑞宇", u"瑞正", u"瑞政", u"睿冰", u"睿儿", u"睿函",
         u"睿琀", u"睿钧", u"睿娉", u"睿堂", u"睿耘", u"睿竹", u"闰梁", u"闰巧", u"润菁", u"润可", u"润沐", u"润起", u"润巧", u"润晴", u"若林", u"若曼",
         u"若萌", u"若秘", u"若棋", u"若珊", u"若瞳", u"若馨", u"若羽", u"若语", u"森棠", u"沙莎", u"莎沙", u"山采", u"山筠", u"彡姗", u"珊畅", u"珊翠",
         u"珊嫡", u"珊璐", u"上上", u"尚好", u"尚欢", u"尚禄", u"韶铭", u"韶楠", u"韶天", u"韶鑫", u"韶轩", u"韶元", u"少棠", u"少伟", u"少毅", u"少元",
         u"少钊", u"邵兵", u"邵华", u"邵亮", u"邵娴", u"绍臣", u"申堂", u"申棠", u"申友", u"绅堂", u"绅棠", u"沈晗", u"沈阳", u"慎银", u"升先", u"生先",
         u"圣贵", u"圣秋", u"圣铁", u"圣先", u"圣献", u"圣银", u"圣泽", u"晟霖", u"晟堂", u"晟棠", u"盛田", u"盛兴", u"盛洋", u"盛业", u"盛茵", u"师源",
         u"诗畅", u"诗录", u"诗蔓", u"诗淼", u"诗茵", u"诗禺", u"诗元", u"施尔", u"十棠", u"时安", u"时业", u"时众", u"时驻", u"时祝", u"士松", u"士涛",
         u"士遐", u"士香", u"士萧", u"士潇", u"士箫", u"士晓", u"士彦", u"士毅", u"世飞", u"世赫", u"世洪", u"世晖", u"世松", u"世桐", u"世萧", u"世潇",
         u"世箫", u"世晓", u"仕元", u"仕泽", u"示泽", u"事泽", u"是忻", u"是轩", u"柿君", u"适晨", u"适诚", u"释遥", u"书玮", u"书希", u"书香", u"书欣",
         u"书逸", u"书泽", u"姝瑾", u"姝伶", u"姝纤", u"殊焰", u"淑滢", u"舒丹", u"舒慧", u"舒桐", u"舒童", u"舒馨", u"舒扬", u"舒依", u"曙力", u"术铃",
         u"树鑫", u"树银", u"树勇", u"树源", u"澍涵", u"澍彤", u"澍薇", u"澍希", u"澍暄", u"澍滢", u"帅宇", u"双发", u"双乾", u"双如", u"双堂", u"双棠",
         u"双伟", u"双卫", u"双颜", u"爽富", u"顺江", u"顺葵", u"顺淞", u"顺新", u"顺泽", u"舜堂", u"烁言", u"铄安", u"铄涵", u"铄千", u"铄洋", u"思枷",
         u"思珍", u"松学", u"泰延", u"惕吾", u"天顺", u"恬沛", u"廷林", u"童绯", u"万江", u"唯炜", u"伟姣", u"炜峰", u"尉增", u"文濠", u"文裕", u"吴迪",
         u"汐情", u"稀禾", u"锡林", u"玺君", u"先财", u"贤德", u"显铮", u"香宇", u"祥芝", u"小逗", u"小亭", u"晓沉", u"晓群", u"晓蓄", u"孝印", u"心旷",
         u"芯廷", u"昕饕", u"欣沅", u"新与", u"馨烛", u"兴晨", u"兴缘", u"修行", u"旭棠", u"宣蔚", u"铄源", u"思槿", u"思稹", u"颂军", u"泰越", u"天博",
         u"天朔", u"恬葸", u"廷钊", u"童语", u"万林", u"惟嘉", u"伟莲", u"炜希", u"尉榛", u"文衡", u"文竹", u"吴颀", u"汐桢", u"稀菏", u"锡麟", u"玺宇",
         u"先驰", u"贤强", u"现民", u"香钰", u"翔昶", u"小干", u"小土", u"晓辰", u"晓芮", u"晓煊", u"孝永", u"心凌", u"芯雯", u"昕欣", u"欣愿", u"新禹",
         u"鑫迦", u"兴法", u"星慧", u"修一", u"旭曦", u"宣吟", u"铄月", u"思菁", u"思佐", u"苏槿", u"堂堂", u"天厂", u"天希", u"恬缘", u"亭驿", u"统政",
         u"万银", u"维范", u"伟仑", u"炜纤", u"渭丰", u"文连", u"文柱", u"吴祺", u"西泓", u"稀林", u"锡强", u"铣钧", u"先迪", u"贤堂", u"宪斌", u"湘海",
         u"想凝", u"小狗", u"小维", u"晓逗", u"晓莎", u"晓玄", u"孝泽", u"心蒙", u"芯仪", u"昕璇", u"欣韵", u"新震", u"鑫俊", u"兴江", u"星秋", u"修易",
         u"旭旭", u"宣州", u"硕良", u"思霖", u"斯含", u"苏靖", u"涛涵", u"天焯", u"天晓", u"甜蜜", u"亭妤", u"涂伟", u"汪春", u"维进", u"伟男", u"炜晔",
         u"渭增", u"文莲", u"纹彤", u"吴越", u"西平", u"稀木", u"熙诚", u"喜儿", u"先恩", u"娴璧", u"宪军", u"湘瑾", u"向盛", u"小恒", u"小星", u"晓妃",
         u"晓帅", u"晓炫", u"肖路", u"心聍", u"芯宜", u"昕泽", u"莘蕊", u"歆瑜", u"鑫力", u"兴莲", u"星求", u"修宇", u"旭羿", u"宣洲", u"厶灏", u"思璐",
         u"斯函", u"苏湄", u"逃生", u"天超", u"天野", u"甜瑜", u"亭妘", u"土法", u"汪涵", u"维亮", u"伟泉", u"炜裕", u"蔚林", u"文墨", u"纹纹", u"五蕴",
         u"西屏", u"稀平", u"熙驰", u"喜涛", u"先昴", u"娴君", u"宪力", u"湘军", u"向弦", u"小糊", u"小宣", u"晓桂", u"晓爽", u"晓绚", u"肖雅", u"心释",
         u"芯与", u"昕鹧", u"莘与", u"歆与", u"鑫淋", u"兴良", u"星球", u"秀凡", u"旭胤", u"萱稼", u"司烊", u"思腩", u"斯诺", u"苏盐", u"陶然", u"天承",
         u"天伊", u"甜羽", u"庭顺", u"拓堂", u"汪松", u"维容", u"伟贤", u"玮炜", u"慰增", u"文宁", u"闻闰", u"武俊", u"西有", u"稀太", u"熙恒", u"禧龙",
         u"先硕", u"显畅", u"宪武", u"湘湄", u"向远", u"小姣", u"小岩", u"晓杭", u"晓顺", u"晓铉", u"哮虎", u"心馨", u"芯禹", u"欣可", u"莘宇", u"歆宇",
         u"鑫麟", u"兴坡", u"星泉", u"秀强", u"续征", u"煊纤", u"司雨", u"思萁", u"斯妤", u"苏影", u"淘宁", u"天城", u"天倚", u"湉湉", u"庭妤", u"拓棠",
         u"汪早", u"维新", u"伟炫", u"玮希", u"魏魏", u"文勤", u"闻堂", u"武云", u"西哲", u"稀韦", u"熙柯", u"细煲", u"先桃", u"显尔", u"宪宇", u"湘琦",
         u"向泽", u"小立", u"小仪", u"晓挥", u"晓土", u"晓钥", u"效君", u"心颜", u"芯月", u"欣盟", u"莘语", u"歆语", u"鑫沛", u"兴琦", u"星兴", u"秀生",
         u"轩赫", u"煊彰", u"司远", u"思前", u"四军", u"夙忻", u"淘荣", u"天虹", u"天茵", u"舔源", u"珽熙", u"娃娃", u"旺佳", u"维兴", u"伟晔", u"韪峄",
         u"文豹", u"文全", u"闻棠", u"悟源", u"希航", u"溪远", u"熙轲", u"细保", u"先筱", u"显豪", u"献晖", u"湘茜", u"骁赋", u"小吏", u"小莺", u"晓汇",
         u"晓霄", u"晓匀", u"效良", u"心译", u"辛棠", u"欣猛", u"新疆", u"馨灿", u"鑫睿", u"兴晴", u"星鱼", u"秀星", u"轩清", u"璇滢", u"思安", u"思闰",
         u"松宾", u"素超", u"淘维", u"天佳", u"天渊", u"铁蛋", u"同贵", u"湾欢", u"旺早", u"维银", u"伟哲", u"卫泽", u"文伯", u"文堂", u"闻忻", u"夕强",
         u"希晶", u"锡峰", u"熙岷", u"细云", u"先义", u"显华", u"相超", u"湘炜", u"骁鼐", u"小利", u"小影", u"晓绘", u"晓心", u"筱非", u"效宇", u"心昭",
         u"辛姚", u"欣茗", u"新炯", u"馨畅", u"鑫升", u"兴秋", u"行峰", u"栩鬟", u"轩硕", u"选赫", u"思橙", u"思晟", u"松歌", u"素涵", u"腾达", u"天蛟",
         u"添铄", u"铁电", u"彤君", u"莞骐", u"威良", u"潍萌", u"纬城", u"卫增", u"文城", u"文棠", u"闻芯", u"夕贞", u"希亮", u"锡豪", u"熙润", u"遐迩",
         u"先觎", u"显菊", u"相辰", u"湘熙", u"萧土", u"小恋", u"小瑗", u"晓俊", u"晓芯", u"筱斐", u"笑杨", u"忻纯", u"辛页", u"欣儒", u"新渼", u"馨灏",
         u"鑫星", u"兴胜", u"杏明", u"栩麟", u"轩堂", u"烜鑫", u"思村", u"思廷", u"松卯", u"素洪", u"腾林", u"天磊", u"添希", u"铁杲", u"彤澍", u"婉名",
         u"威仑", u"潍箐", u"纬增", u"卫中", u"文川", u"文纹", u"闻轩", u"夕珍", u"希孟", u"锡壕", u"熙棠", u"下叶", u"先雨", u"显魁", u"相宏", u"祥德",
         u"潇谥", u"小伶", u"小越", u"晓郡", u"晓行", u"筱睿", u"笑瑗", u"忻晰", u"昕标", u"欣润", u"新蒙", u"馨莲", u"鑫雅", u"兴盛", u"幸秋", u"栩潼",
         u"轩棠", u"泫宏", u"思樊", u"思吴", u"松茂", u"素玟", u"腾煜", u"天旻", u"田歌", u"铁汉", u"彤羿", u"婉铭", u"威增", u"潍箫", u"苇杭", u"未豪",
         u"文岱", u"文雯", u"雯清", u"兮驰", u"析宏", u"锡濠", u"熹之", u"夏慧", u"先泽", u"显溥", u"相涛", u"祥河", u"潇盈", u"小轮", u"小樾", u"晓凯",
         u"晓戌", u"筱旋", u"心铧", u"忻仪", u"昕航", u"欣生", u"新梦", u"馨茗", u"鑫与", u"兴万", u"雄飞", u"旭彬", u"轩智", u"泫希", u"思伽", u"思向",
         u"松冒", u"孙林", u"腾源", u"天诺", u"田乐", u"铁磊", u"桐伽", u"婉容", u"威榛", u"伟仓", u"苇航", u"未晞", u"文等", u"文孝", u"雯瑜", u"兮铧",
         u"析依", u"锡灏", u"羲杰", u"夏枚", u"先致", u"显玮", u"相于", u"祥民", u"潇滢", u"小麦", u"小政", u"晓克", u"晓序", u"筱樾", u"心晖", u"忻与",
         u"昕宏", u"欣研", u"新芮", u"馨润", u"信昌", u"兴友", u"雄新", u"旭丰", u"宣兰", u"泫熠", u"思杭", u"思晓", u"松貌", u"泰昌", u"腾远", u"天荣",
         u"田蕊", u"铁裘", u"桐枷", u"菀柠", u"逶迤", u"伟大", u"苇桃", u"未央", u"文锋", u"文信", u"雯钰", u"兮若", u"唏尼", u"锡合", u"曦辰", u"夏泽",
         u"纤筠", u"显瑜", u"相羽", u"祥祥", u"小爱", u"小沫", u"小忠", u"晓坤", u"晓叙", u"孝朴", u"心柬", u"忻禹", u"昕儒", u"欣叶", u"新晏", u"馨桐",
         u"信兰", u"兴羽", u"修瀚", u"旭兰", u"宣淋", u"炫志", u"思航", u"思绪", u"松明", u"泰辰", u"腾泽", u"天时", u"田石", u"铁生", u"桐亮", u"菀馨",
         u"巍仑", u"伟豪", u"炜彬", u"位增", u"文葛", u"文行", u"沃茵", u"兮译", u"晰夕", u"锡翮", u"曦炎", u"先傲", u"纤千", u"显源", u"香含", u"祥新",
         u"小保", u"小莎", u"小紫", u"晓苓", u"晓绪", u"孝严", u"心炯", u"忻语", u"昕堂", u"欣与", u"新业", u"馨艺", u"信禹", u"兴元", u"修兰", u"旭霖",
         u"宣蓦", u"绚柯", u"思合", u"思印", u"松滔", u"泰达", u"体荣", u"天矢", u"田渊", u"汀洋", u"桐芯", u"万春", u"韦泽", u"伟煌", u"炜城", u"尉曾",
         u"文广", u"文岩", u"乌巧", u"兮贞", u"晰娴", u"锡贺", u"习宇", u"先奥", u"纤允", u"显彰", u"香华", u"祥友", u"小偲", u"小堂", u"晓保", u"晓旎",
         u"晓续", u"孝义", u"心恺", u"芯朵", u"昕棠", u"欣园", u"新叶", u"馨辕", u"信泽", u"兴园", u"修炜", u"旭孟", u"宣棠", u"绚可", u"学法", u"雅鲭",
         u"亚蕊", u"芫祺", u"彦进", u"艳慧", u"洋霖", u"一蜚", u"一兮", u"伊萌", u"依瑞", u"饴博", u"以然", u"艺程", u"亦郎", u"佚菲", u"奕呈", u"弈晴",
         u"挹晴", u"毅峰", u"翼霄", u"胤恒", u"罂珏", u"滢静", u"永栋", u"永颐", u"泳州", u"又萝", u"禺波", u"宇聪", u"宇雄", u"雨楚", u"雨熹", u"禹志",
         u"语珍", u"育兵", u"昱兹", u"裕山", u"誉君", u"原均", u"远涛", u"钥彤", u"云雁", u"运欣", u"学光", u"雅瑞", u"亚姗", u"芫竹", u"彦蔹", u"艳明",
         u"洋烊", u"一函", u"一汐", u"伊诺", u"依希", u"贻矾", u"以亭", u"艺朵", u"亦朗", u"译蔓", u"奕丹", u"弈廷", u"益麟", u"毅锋", u"翼岩", u"胤桁",
         u"罂哲", u"滢瀛", u"永戈", u"永哲", u"勇方", u"又墅", u"禺钦", u"宇丹", u"宇仰", u"雨钢", u"雨玺", u"禹州", u"玉彬", u"育财", u"钰斌", u"裕晟",
         u"毓波", u"原松", u"远园", u"阅琨", u"云洋", u"运忆", u"学家", u"雅铄", u"亚珊", u"言良", u"彦枚", u"艳强", u"尧莲", u"一晗", u"一嘻", u"伊眙",
         u"依析", u"贻菊", u"以依", u"艺非", u"亦泺", u"易珂", u"奕朵", u"弈彤", u"益男", u"毅铭", u"懿丁", u"胤珩", u"樱金", u"瀛友", u"永鸽", u"永祉",
         u"勇格", u"又伟", u"禺芩", u"宇典", u"宇易", u"雨弘", u"雨榭", u"语含", u"玉菠", u"育华", u"钰锋", u"裕彤", u"毓桐", u"原泽", u"远云", u"阅泸",
         u"云泽", u"运珍", u"学来", u"学涞", u"学蕾", u"学亮", u"学瑞", u"雪波", u"雪娣", u"雪枫", u"雪茜", u"雪珍", u"训香", u"雅为", u"雅埙", u"雅伊",
         u"亚北", u"亚宾", u"亚丹", u"亚妃", u"亚翡", u"亚俊", u"亚仑", u"亚朋", u"亚铄", u"亚雄", u"亚璇", u"烟润", u"烟缨", u"烟羽", u"胭脂", u"菸莓",
         u"菸媚", u"严莲", u"严龙", u"言梁", u"言亮", u"岩良", u"岩雯", u"炎昱", u"研闰", u"颜西", u"衍兰", u"衍帅", u"衍妘", u"衍芝", u"彦妙", u"彦勤",
         u"彦如", u"彦闰", u"彦生", u"彦忻", u"彦芯", u"砚心", u"宴冰", u"宴枚", u"宴玫", u"艳芝", u"艳枝", u"焱晨", u"焱堂", u"雁楠", u"滟蕊", u"扬凡",
         u"阳锋", u"阳宏", u"阳明", u"杨博", u"姚杉", u"耀丹", u"耀勤", u"也畅", u"也荣", u"叶培", u"叶书", u"邺韩", u"烨诞", u"一播", u"一驰", u"一赫",
         u"一井", u"一炯", u"一珂", u"一泺", u"一念", u"一裳", u"一石", u"一霜", u"一堂", u"一棠", u"一星", u"一岩", u"一徭", u"一谕", u"一岳", u"一昭",
         u"一峥", u"一正", u"一耔", u"一訾", u"一佐", u"伊屿", u"伊垣", u"伊韫", u"衣泽", u"依辰", u"依飞", u"依函", u"依菡", u"依和", u"依慧", u"依凝",
         u"依席", u"依娴", u"依一", u"依以", u"祎尧", u"壹泽", u"漪盟", u"漪潆", u"仪晗", u"仪宏", u"沂菲", u"贻矽", u"贻怿", u"贻逸", u"眙予", u"颐聪",
         u"乙飞", u"乙朗", u"乙曼", u"乙萌", u"乙萤", u"乙钰", u"钇君", u"钇名", u"旖宁", u"义澈", u"亿菲", u"亿堂", u"弋漫", u"弋渔", u"忆镧", u"忆年",
         u"忆吴", u"艺斐", u"艺翡", u"艺吉", u"艺嘉", u"艺朗", u"艺培", u"艺澎", u"艺瞳", u"艺震", u"仡泽", u"议伟", u"亦玫", u"亦绵", u"亦青", u"亦秋",
         u"亦亭", u"亦桐", u"亦武", u"亦浠", u"亦淅", u"屹程", u"屹峰", u"易萌", u"易朋", u"易生", u"易胜", u"易守", u"易鑫", u"奕飞", u"奕枫", u"奕格",
         u"奕鸿", u"奕闰", u"奕涛", u"奕祥", u"奕延", u"奕严", u"奕瑗", u"奕孜", u"弈童", u"羿岑", u"羿宸", u"羿初", u"羿彤", u"羿泽", u"轶霏", u"轶伦",
         u"轶苏", u"轶堂", u"轶彦", u"益思", u"翊琪", u"翊祺", u"翌豪", u"翌潇", u"翌泽", u"逸墨", u"逸堂", u"逸仙", u"意林", u"溢潇", u"毅韬", u"熠晗",
         u"熠楠", u"熠鑫", u"熠银", u"镒宾", u"镒帆", u"镒凡", u"镒梵", u"镒嘉", u"镒菽", u"懿鸣", u"懿宁", u"音妙", u"音沛", u"殷豪", u"银宝", u"银成",
         u"银忠", u"尹沅", u"尹泽", u"印洮", u"胤衡", u"胤蘅", u"胤鹏", u"胤轩", u"胤哲", u"应东", u"应龙", u"英岑", u"英弘", u"英辉", u"英邝", u"樱涛",
         u"樱陶", u"鹦鹳", u"迎陶", u"茔玙", u"盈冬", u"盈锋", u"盈璐", u"盈夏", u"萤萤", u"营涛", u"颍超", u"颖刚", u"颖娴", u"影华", u"影靓", u"映井",
         u"映殳", u"映兮", u"映心", u"映歆", u"映爻", u"永海", u"永会", u"永开", u"永灵", u"永苓", u"永攀", u"永澎", u"永芹", u"永群", u"永澍", u"永析",
         u"永智", u"咏鸽", u"咏涵", u"咏杭", u"咏灵", u"咏曦", u"咏烜", u"咏言", u"泳丹", u"泳单", u"泳灵", u"勇勇", u"涌清", u"优璇", u"幽君", u"由由",
         u"莜珊", u"友函", u"有函", u"又璁", u"又诞", u"又飞", u"又玮", u"又翔", u"幼苹", u"佑保", u"渝权", u"渝桐", u"于波", u"于飞", u"予波", u"余波",
         u"臾慈", u"禺芹", u"禺勤", u"竽柠", u"娱琨", u"愉波", u"揄彤", u"瑜波", u"瑜佳", u"瑜萱", u"与汉", u"与嘉", u"宇隆", u"宇铭", u"宇柠", u"宇琦",
         u"宇祺", u"宇麒", u"宇钦", u"宇全", u"宇盛", u"宇瞳", u"宇浠", u"宇赞", u"宇卓", u"羽慈", u"羽娣", u"羽典", u"羽惠", u"羽岚", u"羽柠", u"羽馨",
         u"羽烨", u"羽易", u"雨桦", u"雨满", u"雨柠", u"雨樵", u"雨沁", u"雨铄", u"雨涛", u"雨铤", u"雨通", u"雨同", u"雨铜", u"雨莺", u"雨正", u"雨洲",
         u"雨铸", u"俣辰", u"禹波", u"禹畅", u"禹呈", u"禹初", u"禹捷", u"禹睿", u"语佳", u"语可", u"语萌", u"语茉", u"语蓦", u"语柠", u"语昕", u"语馨",
         u"语言", u"语叶", u"语盈", u"玉风", u"玉琨", u"玉连", u"玉梁", u"玉铃", u"玉镁", u"玉柠", u"玉朋", u"玉恬", u"玉馨", u"玉中", u"育金", u"育旋",
         u"育璇", u"育泽", u"郁柠", u"彧斌", u"彧恒", u"彧竹", u"昱慈", u"昱梁", u"昱闰", u"钰靖", u"钰恋", u"钰霖", u"钰铭", u"钰柠", u"钰朋", u"钰桐",
         u"钰湘", u"钰芷", u"御宇", u"裕恒", u"裕桐", u"煜珩", u"煜灵", u"煜命", u"煜廷", u"煜萧", u"煜轩", u"煜滢", u"煜潆", u"煜召", u"誉斌", u"元柏",
         u"元辉", u"元静", u"元琪", u"元祺", u"元钦", u"元祥", u"元樱", u"元源", u"员源", u"沅淇", u"圆宏", u"圆祺", u"圆源", u"袁棋", u"袁琪", u"袁希",
         u"袁析", u"缘姻", u"缘源", u"源富", u"源祥", u"远泽", u"约琨", u"月臣", u"月涵", u"月恒", u"月琨", u"月璐", u"月骐", u"月时", u"月喜", u"岳矗",
         u"跃吉", u"跃琨", u"粤琨", u"越超", u"越成", u"越进", u"越琨", u"越瞳", u"越跃", u"云付", u"云建", u"匀欣", u"芸枫", u"芸可", u"芸菘", u"芸欣",
         u"昀恺", u"允琨", u"允权", u"允中", u"运憧", u"运达", u"韫恺", u"韵艾", u"韵冰", u"韵函", u"韵姣", u"韵平", u"昭孚", u"昭基", u"昭霖", u"昭琦",
         u"召妃", u"巽彧", u"亚蒲", u"芫棋", u"彦冰", u"晏玮", u"杨洪", u"一笛", u"一铤", u"伊骜", u"依骐", u"宜灏", u"以晨", u"艺安", u"亦黄", u"屹宁",
         u"易尤", u"奕子", u"轶茵", u"毅昂", u"燚达", u"胤恩", u"英涛", u"萦焰", u"庸革", u"永信", u"泳曦", u"又君", u"俞宏", u"宇嫒", u"宇淅", u"羽泽",
         u"雨统", u"禹勋", u"语园", u"玉种", u"昱舒", u"裕龙", u"誉诚", u"沅一", u"源翔", u"岳琨", u"云凯", u"运松", u"召辉", u"丫丫", u"亚祺", u"芫琪",
         u"彦岗", u"晏逍", u"洋菁", u"一跺", u"一畹", u"伊函", u"依如", u"宜林", u"以林", u"艺辰", u"亦惠", u"异同", u"易舟", u"弈豪", u"挹青", u"毅帆",
         u"翼菡", u"胤凡", u"英陶", u"滢翠", u"永春", u"永阳", u"泳烜", u"又钧", u"俞之", u"宇般", u"宇芯", u"雨赤", u"雨淅", u"禹哲", u"语哲", u"芋荥",
         u"昱芯", u"裕柠", u"誉德", u"爰源", u"远村", u"岳中", u"云希", u"运希", u"兆丰", u"兆浩", u"贞礼", u"臻学", u"钟宪", u"祝军", u"姿凡", u"子山",
         u"梓珩", u"紫骅", u"自轩", u"钻容", u"兆荣", u"贞兮", u"振博", u"舯昊", u"祝君", u"姿萱", u"子帅", u"梓横", u"紫骊", u"宗亮", u"尊柏", u"兆太",
         u"贞心", u"振川", u"舯浩", u"祝愿", u"姿杨", u"子廷", u"梓衡", u"紫璃", u"宗儒", u"作辉", u"兆巍", u"贞佚", u"振地", u"仲良", u"妆珏", u"滋栋",
         u"子霆", u"梓鉴", u"紫佩", u"宗信", u"作瑜", u"兆新", u"贞之", u"振利", u"仲圃", u"壮状", u"籽桐", u"子潍", u"梓隽", u"紫祁", u"祖辈", u"阼珲",
         u"兆籽", u"针杉", u"振敏", u"仲涛", u"卓峰", u"子尘", u"子形", u"梓茜", u"紫芊", u"祖臣", u"赵巍", u"照妃", u"照兴", u"肇齐", u"珍凤", u"珍祥",
         u"珍瑜", u"桢福", u"振祁", u"振夏", u"振湘", u"忠显", u"仲泽", u"众姝", u"舟昊", u"周平", u"卓函", u"卓男", u"卓宣", u"倬纶", u"子沣", u"子泓",
         u"子荐", u"子君", u"子型", u"子榆", u"子沅", u"子袁", u"梓檀", u"梓玄", u"梓焱", u"梓杨", u"紫帷", u"紫惟", u"紫袭", u"紫潇", u"祖传", u"祖光",
         u"祖豪", u"祖好", u"哲帛", u"桢琦", u"忠信", u"周烊", u"倬仆", u"子浚", u"子在", u"梓烨", u"紫心", u"祖鸣", u"哲均", u"真谷", u"忠洋", u"洲帆",
         u"灼娴", u"子柯", u"子章", u"梓郁", u"紫昕", u"祖奇", u"哲玮", u"真龙", u"忠宇", u"竹馨", u"孜伶", u"子垒", u"子峥", u"梓紫", u"紫暄", u"祖琦",
         u"哲哲", u"真实", u"忠月", u"杼蔹", u"孜绅", u"子隆", u"梓禅", u"紫柏", u"紫云", u"祖松", u"柘一", u"真香", u"忠宗", u"柱良", u"孜堂", u"子泺",
         u"梓锋", u"紫禾", u"自军", u"祖伟", u"贞黎", u"臻熹", u"钟超", u"祝成", u"孜映", u"子勤", u"梓功", u"紫珩", u"自拴", u"祖尉", u"安邦", u"安福",
         u"安歌", u"安国", u"安和", u"安康", u"安澜", u"安民", u"安宁", u"安平", u"安然", u"安顺", u"安翔", u"安晏", u"安宜", u"安怡", u"安易", u"安志",
         u"昂然", u"昂雄"]
# 中国行政区划代码：数据来源国家统计局 http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/
dist_codes=('110000', '110100', '110101', '110102', '110105', '110106', '110107', '110108', '110109', '110111', '110112', '110113', '110114', '110115', '110116', '110117', '110200', '110228', '110229', '120000', '120100', '120101', '120102', '120103', '120104', '120105', '120106', '120110', '120111', '120112', '120113', '120114', '120115', '120116', '120200', '120221', '120223', '120225', '130000', '130100', '130101', '130102', '130103', '130104', '130105', '130107', '130108', '130121', '130123', '130124', '130125', '130126', '130127', '130128', '130129', '130130', '130131', '130132', '130133', '130181', '130182', '130183', '130184', '130185', '130200', '130201', '130202', '130203', '130204', '130205', '130207', '130208', '130209', '130223', '130224', '130225', '130227', '130229', '130281', '130283', '130300', '130301', '130302', '130303', '130304', '130321', '130322', '130323', '130324', '130400', '130401', '130402', '130403', '130404', '130406', '130421', '130423', '130424', '130425', '130426', '130427', '130428', '130429', '130430', '130431', '130432', '130433', '130434', '130435', '130481', '130500', '130501', '130502', '130503', '130521', '130522', '130523', '130524', '130525', '130526', '130527', '130528', '130529', '130530', '130531', '130532', '130533', '130534', '130535', '130581', '130582', '130600', '130601', '130602', '130603', '130604', '130621', '130622', '130623', '130624', '130625', '130626', '130627', '130628', '130629', '130630', '130631', '130632', '130633', '130634', '130635', '130636', '130637', '130638', '130681', '130682', '130683', '130684', '130700', '130701', '130702', '130703', '130705', '130706', '130721', '130722', '130723', '130724', '130725', '130726', '130727', '130728', '130729', '130730', '130731', '130732', '130733', '130800', '130801', '130802', '130803', '130804', '130821', '130822', '130823', '130824', '130825', '130826', '130827', '130828', '130900', '130901', '130902', '130903', '130921', '130922', '130923', '130924', '130925', '130926', '130927', '130928', '130929', '130930', '130981', '130982', '130983', '130984', '131000', '131001', '131002', '131003', '131022', '131023', '131024', '131025', '131026', '131028', '131081', '131082', '131100', '131101', '131102', '131121', '131122', '131123', '131124', '131125', '131126', '131127', '131128', '131181', '131182', '140000', '140100', '140101', '140105', '140106', '140107', '140108', '140109', '140110', '140121', '140122', '140123', '140181', '140200', '140201', '140202', '140203', '140211', '140212', '140221', '140222', '140223', '140224', '140225', '140226', '140227', '140300', '140301', '140302', '140303', '140311', '140321', '140322', '140400', '140401', '140402', '140411', '140421', '140423', '140424', '140425', '140426', '140427', '140428', '140429', '140430', '140431', '140481', '140500', '140501', '140502', '140521', '140522', '140524', '140525', '140581', '140600', '140601', '140602', '140603', '140621', '140622', '140623', '140624', '140700', '140701', '140702', '140721', '140722', '140723', '140724', '140725', '140726', '140727', '140728', '140729', '140781', '140800', '140801', '140802', '140821', '140822', '140823', '140824', '140825', '140826', '140827', '140828', '140829', '140830', '140881', '140882', '140900', '140901', '140902', '140921', '140922', '140923', '140924', '140925', '140926', '140927', '140928', '140929', '140930', '140931', '140932', '140981', '141000', '141001', '141002', '141021', '141022', '141023', '141024', '141025', '141026', '141027', '141028', '141029', '141030', '141031', '141032', '141033', '141034', '141081', '141082', '141100', '141101', '141102', '141121', '141122', '141123', '141124', '141125', '141126', '141127', '141128', '141129', '141130', '141181', '141182', '150000', '150100', '150101', '150102', '150103', '150104', '150105', '150121', '150122', '150123', '150124', '150125', '150200', '150201', '150202', '150203', '150204', '150205', '150206', '150207', '150221', '150222', '150223', '150300', '150301', '150302', '150303', '150304', '150400', '150401', '150402', '150403', '150404', '150421', '150422', '150423', '150424', '150425', '150426', '150428', '150429', '150430', '150500', '150501', '150502', '150521', '150522', '150523', '150524', '150525', '150526', '150581', '150600', '150601', '150602', '150621', '150622', '150623', '150624', '150625', '150626', '150627', '150700', '150701', '150702', '150703', '150721', '150722', '150723', '150724', '150725', '150726', '150727', '150781', '150782', '150783', '150784', '150785', '150800', '150801', '150802', '150821', '150822', '150823', '150824', '150825', '150826', '150900', '150901', '150902', '150921', '150922', '150923', '150924', '150925', '150926', '150927', '150928', '150929', '150981', '152200', '152201', '152202', '152221', '152222', '152223', '152224', '152500', '152501', '152502', '152522', '152523', '152524', '152525', '152526', '152527', '152528', '152529', '152530', '152531', '152900', '152921', '152922', '152923', '210000', '210100', '210101', '210102', '210103', '210104', '210105', '210106', '210111', '210112', '210113', '210114', '210122', '210123', '210124', '210181', '210200', '210201', '210202', '210203', '210204', '210211', '210212', '210213', '210224', '210281', '210282', '210283', '210300', '210301', '210302', '210303', '210304', '210311', '210321', '210323', '210381', '210400', '210401', '210402', '210403', '210404', '210411', '210421', '210422', '210423', '210500', '210501', '210502', '210503', '210504', '210505', '210521', '210522', '210600', '210601', '210602', '210603', '210604', '210624', '210681', '210682', '210700', '210701', '210702', '210703', '210711', '210726', '210727', '210781', '210782', '210800', '210801', '210802', '210803', '210804', '210811', '210881', '210882', '210900', '210901', '210902', '210903', '210904', '210905', '210911', '210921', '210922', '211000', '211001', '211002', '211003', '211004', '211005', '211011', '211021', '211081', '211100', '211101', '211102', '211103', '211121', '211122', '211200', '211201', '211202', '211204', '211221', '211223', '211224', '211281', '211282', '211300', '211301', '211302', '211303', '211321', '211322', '211324', '211381', '211382', '211400', '211401', '211402', '211403', '211404', '211421', '211422', '211481', '220000', '220100', '220101', '220102', '220103', '220104', '220105', '220106', '220112', '220122', '220181', '220182', '220183', '220200', '220201', '220202', '220203', '220204', '220211', '220221', '220281', '220282', '220283', '220284', '220300', '220301', '220302', '220303', '220322', '220323', '220381', '220382', '220400', '220401', '220402', '220403', '220421', '220422', '220500', '220501', '220502', '220503', '220521', '220523', '220524', '220581', '220582', '220600', '220601', '220602', '220605', '220621', '220622', '220623', '220681', '220700', '220701', '220702', '220721', '220722', '220723', '220781', '220800', '220801', '220802', '220821', '220822', '220881', '220882', '222400', '222401', '222402', '222403', '222404', '222405', '222406', '222424', '222426', '230000', '230100', '230101', '230102', '230103', '230104', '230108', '230109', '230110', '230111', '230112', '230123', '230124', '230125', '230126', '230127', '230128', '230129', '230182', '230183', '230184', '230200', '230201', '230202', '230203', '230204', '230205', '230206', '230207', '230208', '230221', '230223', '230224', '230225', '230227', '230229', '230230', '230231', '230281', '230300', '230301', '230302', '230303', '230304', '230305', '230306', '230307', '230321', '230381', '230382', '230400', '230401', '230402', '230403', '230404', '230405', '230406', '230407', '230421', '230422', '230500', '230501', '230502', '230503', '230505', '230506', '230521', '230522', '230523', '230524', '230600', '230601', '230602', '230603', '230604', '230605', '230606', '230621', '230622', '230623', '230624', '230700', '230701', '230702', '230703', '230704', '230705', '230706', '230707', '230708', '230709', '230710', '230711', '230712', '230713', '230714', '230715', '230716', '230722', '230781', '230800', '230801', '230803', '230804', '230805', '230811', '230822', '230826', '230828', '230833', '230881', '230882', '230900', '230901', '230902', '230903', '230904', '230921', '231000', '231001', '231002', '231003', '231004', '231005', '231024', '231025', '231081', '231083', '231084', '231085', '231100', '231101', '231102', '231121', '231123', '231124', '231181', '231182', '231200', '231201', '231202', '231221', '231222', '231223', '231224', '231225', '231226', '231281', '231282', '231283', '232700', '232721', '232722', '232723', '310000', '310100', '310101', '310104', '310105', '310106', '310107', '310108', '310109', '310110', '310112', '310113', '310114', '310115', '310116', '310117', '310118', '310120', '310200', '310230', '320000', '320100', '320101', '320102', '320104', '320105', '320106', '320111', '320113', '320114', '320115', '320116', '320117', '320118', '320200', '320201', '320202', '320203', '320204', '320205', '320206', '320211', '320281', '320282', '320300', '320301', '320302', '320303', '320305', '320311', '320312', '320321', '320322', '320324', '320381', '320382', '320400', '320401', '320402', '320404', '320405', '320411', '320412', '320481', '320482', '320500', '320501', '320505', '320506', '320507', '320508', '320509', '320581', '320582', '320583', '320585', '320600', '320601', '320602', '320611', '320612', '320621', '320623', '320681', '320682', '320684', '320700', '320701', '320703', '320705', '320706', '320721', '320722', '320723', '320724', '320800', '320801', '320802', '320803', '320804', '320811', '320826', '320829', '320830', '320831', '320900', '320901', '320902', '320903', '320921', '320922', '320923', '320924', '320925', '320981', '320982', '321000', '321001', '321002', '321003', '321012', '321023', '321081', '321084', '321100', '321101', '321102', '321111', '321112', '321181', '321182', '321183', '321200', '321201', '321202', '321203', '321204', '321281', '321282', '321283', '321300', '321301', '321302', '321311', '321322', '321323', '321324', '330000', '330100', '330101', '330102', '330103', '330104', '330105', '330106', '330108', '330109', '330110', '330122', '330127', '330182', '330183', '330185', '330200', '330201', '330203', '330204', '330205', '330206', '330211', '330212', '330225', '330226', '330281', '330282', '330283', '330300', '330301', '330302', '330303', '330304', '330322', '330324', '330326', '330327', '330328', '330329', '330381', '330382', '330400', '330401', '330402', '330411', '330421', '330424', '330481', '330482', '330483', '330500', '330501', '330502', '330503', '330521', '330522', '330523', '330600', '330601', '330602', '330621', '330624', '330681', '330682', '330683', '330700', '330701', '330702', '330703', '330723', '330726', '330727', '330781', '330782', '330783', '330784', '330800', '330801', '330802', '330803', '330822', '330824', '330825', '330881', '330900', '330901', '330902', '330903', '330921', '330922', '331000', '331001', '331002', '331003', '331004', '331021', '331022', '331023', '331024', '331081', '331082', '331100', '331101', '331102', '331121', '331122', '331123', '331124', '331125', '331126', '331127', '331181', '340000', '340100', '340101', '340102', '340103', '340104', '340111', '340121', '340122', '340123', '340124', '340181', '340200', '340201', '340202', '340203', '340207', '340208', '340221', '340222', '340223', '340225', '340300', '340301', '340302', '340303', '340304', '340311', '340321', '340322', '340323', '340400', '340401', '340402', '340403', '340404', '340405', '340406', '340421', '340500', '340501', '340503', '340504', '340506', '340521', '340522', '340523', '340600', '340601', '340602', '340603', '340604', '340621', '340700', '340701', '340702', '340703', '340711', '340721', '340800', '340801', '340802', '340803', '340811', '340822', '340823', '340824', '340825', '340826', '340827', '340828', '340881', '341000', '341001', '341002', '341003', '341004', '341021', '341022', '341023', '341024', '341100', '341101', '341102', '341103', '341122', '341124', '341125', '341126', '341181', '341182', '341200', '341201', '341202', '341203', '341204', '341221', '341222', '341225', '341226', '341282', '341300', '341301', '341302', '341321', '341322', '341323', '341324', '341500', '341501', '341502', '341503', '341521', '341522', '341523', '341524', '341525', '341600', '341601', '341602', '341621', '341622', '341623', '341700', '341701', '341702', '341721', '341722', '341723', '341800', '341801', '341802', '341821', '341822', '341823', '341824', '341825', '341881', '350000', '350100', '350101', '350102', '350103', '350104', '350105', '350111', '350121', '350122', '350123', '350124', '350125', '350128', '350181', '350182', '350200', '350201', '350203', '350205', '350206', '350211', '350212', '350213', '350300', '350301', '350302', '350303', '350304', '350305', '350322', '350400', '350401', '350402', '350403', '350421', '350423', '350424', '350425', '350426', '350427', '350428', '350429', '350430', '350481', '350500', '350501', '350502', '350503', '350504', '350505', '350521', '350524', '350525', '350526', '350527', '350581', '350582', '350583', '350600', '350601', '350602', '350603', '350622', '350623', '350624', '350625', '350626', '350627', '350628', '350629', '350681', '350700', '350701', '350702', '350721', '350722', '350723', '350724', '350725', '350781', '350782', '350783', '350784', '350800', '350801', '350802', '350821', '350822', '350823', '350824', '350825', '350881', '350900', '350901', '350902', '350921', '350922', '350923', '350924', '350925', '350926', '350981', '350982', '360000', '360100', '360101', '360102', '360103', '360104', '360105', '360111', '360121', '360122', '360123', '360124', '360200', '360201', '360202', '360203', '360222', '360281', '360300', '360301', '360302', '360313', '360321', '360322', '360323', '360400', '360401', '360402', '360403', '360421', '360423', '360424', '360425', '360426', '360427', '360428', '360429', '360430', '360481', '360482', '360500', '360501', '360502', '360521', '360600', '360601', '360602', '360622', '360681', '360700', '360701', '360702', '360721', '360722', '360723', '360724', '360725', '360726', '360727', '360728', '360729', '360730', '360731', '360732', '360733', '360734', '360735', '360781', '360782', '360800', '360801', '360802', '360803', '360821', '360822', '360823', '360824', '360825', '360826', '360827', '360828', '360829', '360830', '360881', '360900', '360901', '360902', '360921', '360922', '360923', '360924', '360925', '360926', '360981', '360982', '360983', '361000', '361001', '361002', '361021', '361022', '361023', '361024', '361025', '361026', '361027', '361028', '361029', '361030', '361100', '361101', '361102', '361121', '361122', '361123', '361124', '361125', '361126', '361127', '361128', '361129', '361130', '361181', '370000', '370100', '370101', '370102', '370103', '370104', '370105', '370112', '370113', '370124', '370125', '370126', '370181', '370200', '370201', '370202', '370203', '370211', '370212', '370213', '370214', '370281', '370282', '370283', '370285', '370300', '370301', '370302', '370303', '370304', '370305', '370306', '370321', '370322', '370323', '370400', '370401', '370402', '370403', '370404', '370405', '370406', '370481', '370500', '370501', '370502', '370503', '370521', '370522', '370523', '370600', '370601', '370602', '370611', '370612', '370613', '370634', '370681', '370682', '370683', '370684', '370685', '370686', '370687', '370700', '370701', '370702', '370703', '370704', '370705', '370724', '370725', '370781', '370782', '370783', '370784', '370785', '370786', '370800', '370801', '370802', '370811', '370826', '370827', '370828', '370829', '370830', '370831', '370832', '370881', '370882', '370883', '370900', '370901', '370902', '370911', '370921', '370923', '370982', '370983', '371000', '371001', '371002', '371081', '371082', '371083', '371100', '371101', '371102', '371103', '371121', '371122', '371200', '371201', '371202', '371203', '371300', '371301', '371302', '371311', '371312', '371321', '371322', '371323', '371324', '371325', '371326', '371327', '371328', '371329', '371400', '371401', '371402', '371421', '371422', '371423', '371424', '371425', '371426', '371427', '371428', '371481', '371482', '371500', '371501', '371502', '371521', '371522', '371523', '371524', '371525', '371526', '371581', '371600', '371601', '371602', '371621', '371622', '371623', '371624', '371625', '371626', '371700', '371701', '371702', '371721', '371722', '371723', '371724', '371725', '371726', '371727', '371728', '410000', '410100', '410101', '410102', '410103', '410104', '410105', '410106', '410108', '410122', '410181', '410182', '410183', '410184', '410185', '410200', '410201', '410202', '410203', '410204', '410205', '410211', '410221', '410222', '410223', '410224', '410225', '410300', '410301', '410302', '410303', '410304', '410305', '410306', '410311', '410322', '410323', '410324', '410325', '410326', '410327', '410328', '410329', '410381', '410400', '410401', '410402', '410403', '410404', '410411', '410421', '410422', '410423', '410425', '410481', '410482', '410500', '410501', '410502', '410503', '410505', '410506', '410522', '410523', '410526', '410527', '410581', '410600', '410601', '410602', '410603', '410611', '410621', '410622', '410700', '410701', '410702', '410703', '410704', '410711', '410721', '410724', '410725', '410726', '410727', '410728', '410781', '410782', '410800', '410801', '410802', '410803', '410804', '410811', '410821', '410822', '410823', '410825', '410882', '410883', '410900', '410901', '410902', '410922', '410923', '410926', '410927', '410928', '411000', '411001', '411002', '411023', '411024', '411025', '411081', '411082', '411100', '411101', '411102', '411103', '411104', '411121', '411122', '411200', '411201', '411202', '411221', '411222', '411224', '411281', '411282', '411300', '411301', '411302', '411303', '411321', '411322', '411323', '411324', '411325', '411326', '411327', '411328', '411329', '411330', '411381', '411400', '411401', '411402', '411403', '411421', '411422', '411423', '411424', '411425', '411426', '411481', '411500', '411501', '411502', '411503', '411521', '411522', '411523', '411524', '411525', '411526', '411527', '411528', '411600', '411601', '411602', '411621', '411622', '411623', '411624', '411625', '411626', '411627', '411628', '411681', '411700', '411701', '411702', '411721', '411722', '411723', '411724', '411725', '411726', '411727', '411728', '411729', '419000', '419001', '420000', '420100', '420101', '420102', '420103', '420104', '420105', '420106', '420107', '420111', '420112', '420113', '420114', '420115', '420116', '420117', '420200', '420201', '420202', '420203', '420204', '420205', '420222', '420281', '420300', '420301', '420302', '420303', '420321', '420322', '420323', '420324', '420325', '420381', '420500', '420501', '420502', '420503', '420504', '420505', '420506', '420525', '420526', '420527', '420528', '420529', '420581', '420582', '420583', '420600', '420601', '420602', '420606', '420607', '420624', '420625', '420626', '420682', '420683', '420684', '420700', '420701', '420702', '420703', '420704', '420800', '420801', '420802', '420804', '420821', '420822', '420881', '420900', '420901', '420902', '420921', '420922', '420923', '420981', '420982', '420984', '421000', '421001', '421002', '421003', '421022', '421023', '421024', '421081', '421083', '421087', '421100', '421101', '421102', '421121', '421122', '421123', '421124', '421125', '421126', '421127', '421181', '421182', '421200', '421201', '421202', '421221', '421222', '421223', '421224', '421281', '421300', '421301', '421303', '421321', '421381', '422800', '422801', '422802', '422822', '422823', '422825', '422826', '422827', '422828', '429000', '429004', '429005', '429006', '429021', '430000', '430100', '430101', '430102', '430103', '430104', '430105', '430111', '430112', '430121', '430124', '430181', '430200', '430201', '430202', '430203', '430204', '430211', '430221', '430223', '430224', '430225', '430281', '430300', '430301', '430302', '430304', '430321', '430381', '430382', '430400', '430401', '430405', '430406', '430407', '430408', '430412', '430421', '430422', '430423', '430424', '430426', '430481', '430482', '430500', '430501', '430502', '430503', '430511', '430521', '430522', '430523', '430524', '430525', '430527', '430528', '430529', '430581', '430600', '430601', '430602', '430603', '430611', '430621', '430623', '430624', '430626', '430681', '430682', '430700', '430701', '430702', '430703', '430721', '430722', '430723', '430724', '430725', '430726', '430781', '430800', '430801', '430802', '430811', '430821', '430822', '430900', '430901', '430902', '430903', '430921', '430922', '430923', '430981', '431000', '431001', '431002', '431003', '431021', '431022', '431023', '431024', '431025', '431026', '431027', '431028', '431081', '431100', '431101', '431102', '431103', '431121', '431122', '431123', '431124', '431125', '431126', '431127', '431128', '431129', '431200', '431201', '431202', '431221', '431222', '431223', '431224', '431225', '431226', '431227', '431228', '431229', '431230', '431281', '431300', '431301', '431302', '431321', '431322', '431381', '431382', '433100', '433101', '433122', '433123', '433124', '433125', '433126', '433127', '433130', '440000', '440100', '440101', '440103', '440104', '440105', '440106', '440111', '440112', '440113', '440114', '440115', '440116', '440183', '440184', '440200', '440201', '440203', '440204', '440205', '440222', '440224', '440229', '440232', '440233', '440281', '440282', '440300', '440301', '440303', '440304', '440305', '440306', '440307', '440308', '440400', '440401', '440402', '440403', '440404', '440500', '440501', '440507', '440511', '440512', '440513', '440514', '440515', '440523', '440600', '440601', '440604', '440605', '440606', '440607', '440608', '440700', '440701', '440703', '440704', '440705', '440781', '440783', '440784', '440785', '440800', '440801', '440802', '440803', '440804', '440811', '440823', '440825', '440881', '440882', '440883', '440900', '440901', '440902', '440903', '440923', '440981', '440982', '440983', '441200', '441201', '441202', '441203', '441223', '441224', '441225', '441226', '441283', '441284', '441300', '441301', '441302', '441303', '441322', '441323', '441324', '441400', '441401', '441402', '441421', '441422', '441423', '441424', '441426', '441427', '441481', '441500', '441501', '441502', '441521', '441523', '441581', '441600', '441601', '441602', '441621', '441622', '441623', '441624', '441625', '441700', '441701', '441702', '441721', '441723', '441781', '441800', '441801', '441802', '441803', '441821', '441823', '441825', '441826', '441881', '441882', '441900', '442000', '445100', '445101', '445102', '445103', '445122', '445200', '445201', '445202', '445203', '445222', '445224', '445281', '445300', '445301', '445302', '445321', '445322', '445323', '445381', '450000', '450100', '450101', '450102', '450103', '450105', '450107', '450108', '450109', '450122', '450123', '450124', '450125', '450126', '450127', '450200', '450201', '450202', '450203', '450204', '450205', '450221', '450222', '450223', '450224', '450225', '450226', '450300', '450301', '450302', '450303', '450304', '450305', '450311', '450312', '450321', '450323', '450324', '450325', '450326', '450327', '450328', '450329', '450330', '450331', '450332', '450400', '450401', '450403', '450405', '450406', '450421', '450422', '450423', '450481', '450500', '450501', '450502', '450503', '450512', '450521', '450600', '450601', '450602', '450603', '450621', '450681', '450700', '450701', '450702', '450703', '450721', '450722', '450800', '450801', '450802', '450803', '450804', '450821', '450881', '450900', '450901', '450902', '450903', '450921', '450922', '450923', '450924', '450981', '451000', '451001', '451002', '451021', '451022', '451023', '451024', '451025', '451026', '451027', '451028', '451029', '451030', '451031', '451100', '451101', '451102', '451121', '451122', '451123', '451200', '451201', '451202', '451221', '451222', '451223', '451224', '451225', '451226', '451227', '451228', '451229', '451281', '451300', '451301', '451302', '451321', '451322', '451323', '451324', '451381', '451400', '451401', '451402', '451421', '451422', '451423', '451424', '451425', '451481', '460000', '460100', '460101', '460105', '460106', '460107', '460108', '460200', '460201', '460300', '460321', '460322', '460323', '469000', '469001', '469002', '469003', '469005', '469006', '469007', '469021', '469022', '469023', '469024', '469025', '469026', '469027', '469028', '469029', '469030', '500000', '500100', '500101', '500102', '500103', '500104', '500105', '500106', '500107', '500108', '500109', '500110', '500111', '500112', '500113', '500114', '500115', '500116', '500117', '500118', '500119', '500200', '500223', '500224', '500226', '500227', '500228', '500229', '500230', '500231', '500232', '500233', '500234', '500235', '500236', '500237', '500238', '500240', '500241', '500242', '500243', '510000', '510100', '510101', '510104', '510105', '510106', '510107', '510108', '510112', '510113', '510114', '510115', '510121', '510122', '510124', '510129', '510131', '510132', '510181', '510182', '510183', '510184', '510300', '510301', '510302', '510303', '510304', '510311', '510321', '510322', '510400', '510401', '510402', '510403', '510411', '510421', '510422', '510500', '510501', '510502', '510503', '510504', '510521', '510522', '510524', '510525', '510600', '510601', '510603', '510623', '510626', '510681', '510682', '510683', '510700', '510701', '510703', '510704', '510722', '510723', '510724', '510725', '510726', '510727', '510781', '510800', '510801', '510802', '510811', '510812', '510821', '510822', '510823', '510824', '510900', '510901', '510903', '510904', '510921', '510922', '510923', '511000', '511001', '511002', '511011', '511024', '511025', '511028', '511100', '511101', '511102', '511111', '511112', '511113', '511123', '511124', '511126', '511129', '511132', '511133', '511181', '511300', '511301', '511302', '511303', '511304', '511321', '511322', '511323', '511324', '511325', '511381', '511400', '511401', '511402', '511421', '511422', '511423', '511424', '511425', '511500', '511501', '511502', '511503', '511521', '511523', '511524', '511525', '511526', '511527', '511528', '511529', '511600', '511601', '511602', '511603', '511621', '511622', '511623', '511681', '511700', '511701', '511702', '511703', '511722', '511723', '511724', '511725', '511781', '511800', '511801', '511802', '511803', '511822', '511823', '511824', '511825', '511826', '511827', '511900', '511901', '511902', '511903', '511921', '511922', '511923', '512000', '512001', '512002', '512021', '512022', '512081', '513200', '513221', '513222', '513223', '513224', '513225', '513226', '513227', '513228', '513229', '513230', '513231', '513232', '513233', '513300', '513321', '513322', '513323', '513324', '513325', '513326', '513327', '513328', '513329', '513330', '513331', '513332', '513333', '513334', '513335', '513336', '513337', '513338', '513400', '513401', '513422', '513423', '513424', '513425', '513426', '513427', '513428', '513429', '513430', '513431', '513432', '513433', '513434', '513435', '513436', '513437', '520000', '520100', '520101', '520102', '520103', '520111', '520112', '520113', '520115', '520121', '520122', '520123', '520181', '520200', '520201', '520203', '520221', '520222', '520300', '520301', '520302', '520303', '520321', '520322', '520323', '520324', '520325', '520326', '520327', '520328', '520329', '520330', '520381', '520382', '520400', '520401', '520402', '520421', '520422', '520423', '520424', '520425', '520500', '520501', '520502', '520521', '520522', '520523', '520524', '520525', '520526', '520527', '520600', '520601', '520602', '520603', '520621', '520622', '520623', '520624', '520625', '520626', '520627', '520628', '522300', '522301', '522322', '522323', '522324', '522325', '522326', '522327', '522328', '522600', '522601', '522622', '522623', '522624', '522625', '522626', '522627', '522628', '522629', '522630', '522631', '522632', '522633', '522634', '522635', '522636', '522700', '522701', '522702', '522722', '522723', '522725', '522726', '522727', '522728', '522729', '522730', '522731', '522732', '530000', '530100', '530101', '530102', '530103', '530111', '530112', '530113', '530114', '530122', '530124', '530125', '530126', '530127', '530128', '530129', '530181', '530300', '530301', '530302', '530321', '530322', '530323', '530324', '530325', '530326', '530328', '530381', '530400', '530401', '530402', '530421', '530422', '530423', '530424', '530425', '530426', '530427', '530428', '530500', '530501', '530502', '530521', '530522', '530523', '530524', '530600', '530601', '530602', '530621', '530622', '530623', '530624', '530625', '530626', '530627', '530628', '530629', '530630', '530700', '530701', '530702', '530721', '530722', '530723', '530724', '530800', '530801', '530802', '530821', '530822', '530823', '530824', '530825', '530826', '530827', '530828', '530829', '530900', '530901', '530902', '530921', '530922', '530923', '530924', '530925', '530926', '530927', '532300', '532301', '532322', '532323', '532324', '532325', '532326', '532327', '532328', '532329', '532331', '532500', '532501', '532502', '532503', '532504', '532523', '532524', '532525', '532527', '532528', '532529', '532530', '532531', '532532', '532600', '532601', '532622', '532623', '532624', '532625', '532626', '532627', '532628', '532800', '532801', '532822', '532823', '532900', '532901', '532922', '532923', '532924', '532925', '532926', '532927', '532928', '532929', '532930', '532931', '532932', '533100', '533102', '533103', '533122', '533123', '533124', '533300', '533321', '533323', '533324', '533325', '533400', '533421', '533422', '533423', '540000', '540100', '540101', '540102', '540121', '540122', '540123', '540124', '540125', '540126', '540127', '542100', '542121', '542122', '542123', '542124', '542125', '542126', '542127', '542128', '542129', '542132', '542133', '542200', '542221', '542222', '542223', '542224', '542225', '542226', '542227', '542228', '542229', '542231', '542232', '542233', '542300', '542301', '542322', '542323', '542324', '542325', '542326', '542327', '542328', '542329', '542330', '542331', '542332', '542333', '542334', '542335', '542336', '542337', '542338', '542400', '542421', '542422', '542423', '542424', '542425', '542426', '542427', '542428', '542429', '542430', '542431', '542500', '542521', '542522', '542523', '542524', '542525', '542526', '542527', '542600', '542621', '542622', '542623', '542624', '542625', '542626', '542627', '610000', '610100', '610101', '610102', '610103', '610104', '610111', '610112', '610113', '610114', '610115', '610116', '610122', '610124', '610125', '610126', '610200', '610201', '610202', '610203', '610204', '610222', '610300', '610301', '610302', '610303', '610304', '610322', '610323', '610324', '610326', '610327', '610328', '610329', '610330', '610331', '610400', '610401', '610402', '610403', '610404', '610422', '610423', '610424', '610425', '610426', '610427', '610428', '610429', '610430', '610431', '610481', '610500', '610501', '610502', '610521', '610522', '610523', '610524', '610525', '610526', '610527', '610528', '610581', '610582', '610600', '610601', '610602', '610621', '610622', '610623', '610624', '610625', '610626', '610627', '610628', '610629', '610630', '610631', '610632', '610700', '610701', '610702', '610721', '610722', '610723', '610724', '610725', '610726', '610727', '610728', '610729', '610730', '610800', '610801', '610802', '610821', '610822', '610823', '610824', '610825', '610826', '610827', '610828', '610829', '610830', '610831', '610900', '610901', '610902', '610921', '610922', '610923', '610924', '610925', '610926', '610927', '610928', '610929', '611000', '611001', '611002', '611021', '611022', '611023', '611024', '611025', '611026', '620000', '620100', '620101', '620102', '620103', '620104', '620105', '620111', '620121', '620122', '620123', '620200', '620201', '620300', '620301', '620302', '620321', '620400', '620401', '620402', '620403', '620421', '620422', '620423', '620500', '620501', '620502', '620503', '620521', '620522', '620523', '620524', '620525', '620600', '620601', '620602', '620621', '620622', '620623', '620700', '620701', '620702', '620721', '620722', '620723', '620724', '620725', '620800', '620801', '620802', '620821', '620822', '620823', '620824', '620825', '620826', '620900', '620901', '620902', '620921', '620922', '620923', '620924', '620981', '620982', '621000', '621001', '621002', '621021', '621022', '621023', '621024', '621025', '621026', '621027', '621100', '621101', '621102', '621121', '621122', '621123', '621124', '621125', '621126', '621200', '621201', '621202', '621221', '621222', '621223', '621224', '621225', '621226', '621227', '621228', '622900', '622901', '622921', '622922', '622923', '622924', '622925', '622926', '622927', '623000', '623001', '623021', '623022', '623023', '623024', '623025', '623026', '623027', '630000', '630100', '630101', '630102', '630103', '630104', '630105', '630121', '630122', '630123', '630200', '630202', '630221', '630222', '630223', '630224', '630225', '632200', '632221', '632222', '632223', '632224', '632300', '632321', '632322', '632323', '632324', '632500', '632521', '632522', '632523', '632524', '632525', '632600', '632621', '632622', '632623', '632624', '632625', '632626', '632700', '632701', '632722', '632723', '632724', '632725', '632726', '632800', '632801', '632802', '632821', '632822', '632823', '640000', '640100', '640101', '640104', '640105', '640106', '640121', '640122', '640181', '640200', '640201', '640202', '640205', '640221', '640300', '640301', '640302', '640303', '640323', '640324', '640381', '640400', '640401', '640402', '640422', '640423', '640424', '640425', '640500', '640501', '640502', '640521', '640522', '650000', '650100', '650101', '650102', '650103', '650104', '650105', '650106', '650107', '650109', '650121', '650200', '650201', '650202', '650203', '650204', '650205', '652100', '652101', '652122', '652123', '652200', '652201', '652222', '652223', '652300', '652301', '652302', '652323', '652324', '652325', '652327', '652328', '652700', '652701', '652702', '652722', '652723', '652800', '652801', '652822', '652823', '652824', '652825', '652826', '652827', '652828', '652829', '652900', '652901', '652922', '652923', '652924', '652925', '652926', '652927', '652928', '652929', '653000', '653001', '653022', '653023', '653024', '653100', '653101', '653121', '653122', '653123', '653124', '653125', '653126', '653127', '653128', '653129', '653130', '653131', '653200', '653201', '653221', '653222', '653223', '653224', '653225', '653226', '653227', '654000', '654002', '654003', '654021', '654022', '654023', '654024', '654025', '654026', '654027', '654028', '654200', '654201', '654202', '654221', '654223', '654224', '654225', '654226', '654300', '654301', '654321', '654322', '654323', '654324', '654325', '654326', '659000', '659001', '659002', '659003', '659004', '710000', '810000', '820000')
dist_names=(u'北京市', u'市辖区', u'东城区', u'西城区', u'朝阳区', u'丰台区', u'石景山区', u'海淀区', u'门头沟区', u'房山区', u'通州区', u'顺义区', u'昌平区', u'大兴区', u'怀柔区', u'平谷区', u'县', u'密云县', u'延庆县', u'天津市', u'市辖区', u'和平区', u'河东区', u'河西区', u'南开区', u'河北区', u'红桥区', u'东丽区', u'西青区', u'津南区', u'北辰区', u'武清区', u'宝坻区', u'滨海新区', u'县', u'宁河县', u'静海县', u'蓟县', u'河北省', u'石家庄市', u'市辖区', u'长安区', u'桥东区', u'桥西区', u'新华区', u'井陉矿区', u'裕华区', u'井陉县', u'正定县', u'栾城县', u'行唐县', u'灵寿县', u'高邑县', u'深泽县', u'赞皇县', u'无极县', u'平山县', u'元氏县', u'赵县', u'辛集市', u'藁城市', u'晋州市', u'新乐市', u'鹿泉市', u'唐山市', u'市辖区', u'路南区', u'路北区', u'古冶区', u'开平区', u'丰南区', u'丰润区', u'曹妃甸区', u'滦县', u'滦南县', u'乐亭县', u'迁西县', u'玉田县', u'遵化市', u'迁安市', u'秦皇岛市', u'市辖区', u'海港区', u'山海关区', u'北戴河区', u'青龙满族自治县', u'昌黎县', u'抚宁县', u'卢龙县', u'邯郸市', u'市辖区', u'邯山区', u'丛台区', u'复兴区', u'峰峰矿区', u'邯郸县', u'临漳县', u'成安县', u'大名县', u'涉县', u'磁县', u'肥乡县', u'永年县', u'邱县', u'鸡泽县', u'广平县', u'馆陶县', u'魏县', u'曲周县', u'武安市', u'邢台市', u'市辖区', u'桥东区', u'桥西区', u'邢台县', u'临城县', u'内丘县', u'柏乡县', u'隆尧县', u'任县', u'南和县', u'宁晋县', u'巨鹿县', u'新河县', u'广宗县', u'平乡县', u'威县', u'清河县', u'临西县', u'南宫市', u'沙河市', u'保定市', u'市辖区', u'新市区', u'北市区', u'南市区', u'满城县', u'清苑县', u'涞水县', u'阜平县', u'徐水县', u'定兴县', u'唐县', u'高阳县', u'容城县', u'涞源县', u'望都县', u'安新县', u'易县', u'曲阳县', u'蠡县', u'顺平县', u'博野县', u'雄县', u'涿州市', u'定州市', u'安国市', u'高碑店市', u'张家口市', u'市辖区', u'桥东区', u'桥西区', u'宣化区', u'下花园区', u'宣化县', u'张北县', u'康保县', u'沽源县', u'尚义县', u'蔚县', u'阳原县', u'怀安县', u'万全县', u'怀来县', u'涿鹿县', u'赤城县', u'崇礼县', u'承德市', u'市辖区', u'双桥区', u'双滦区', u'鹰手营子矿区', u'承德县', u'兴隆县', u'平泉县', u'滦平县', u'隆化县', u'丰宁满族自治县', u'宽城满族自治县', u'围场满族蒙古族自治县', u'沧州市', u'市辖区', u'新华区', u'运河区', u'沧县', u'青县', u'东光县', u'海兴县', u'盐山县', u'肃宁县', u'南皮县', u'吴桥县', u'献县', u'孟村回族自治县', u'泊头市', u'任丘市', u'黄骅市', u'河间市', u'廊坊市', u'市辖区', u'安次区', u'广阳区', u'固安县', u'永清县', u'香河县', u'大城县', u'文安县', u'大厂回族自治县', u'霸州市', u'三河市', u'衡水市', u'市辖区', u'桃城区', u'枣强县', u'武邑县', u'武强县', u'饶阳县', u'安平县', u'故城县', u'景县', u'阜城县', u'冀州市', u'深州市', u'山西省', u'太原市', u'市辖区', u'小店区', u'迎泽区', u'杏花岭区', u'尖草坪区', u'万柏林区', u'晋源区', u'清徐县', u'阳曲县', u'娄烦县', u'古交市', u'大同市', u'市辖区', u'城区', u'矿区', u'南郊区', u'新荣区', u'阳高县', u'天镇县', u'广灵县', u'灵丘县', u'浑源县', u'左云县', u'大同县', u'阳泉市', u'市辖区', u'城区', u'矿区', u'郊区', u'平定县', u'盂县', u'长治市', u'市辖区', u'城区', u'郊区', u'长治县', u'襄垣县', u'屯留县', u'平顺县', u'黎城县', u'壶关县', u'长子县', u'武乡县', u'沁县', u'沁源县', u'潞城市', u'晋城市', u'市辖区', u'城区', u'沁水县', u'阳城县', u'陵川县', u'泽州县', u'高平市', u'朔州市', u'市辖区', u'朔城区', u'平鲁区', u'山阴县', u'应县', u'右玉县', u'怀仁县', u'晋中市', u'市辖区', u'榆次区', u'榆社县', u'左权县', u'和顺县', u'昔阳县', u'寿阳县', u'太谷县', u'祁县', u'平遥县', u'灵石县', u'介休市', u'运城市', u'市辖区', u'盐湖区', u'临猗县', u'万荣县', u'闻喜县', u'稷山县', u'新绛县', u'绛县', u'垣曲县', u'夏县', u'平陆县', u'芮城县', u'永济市', u'河津市', u'忻州市', u'市辖区', u'忻府区', u'定襄县', u'五台县', u'代县', u'繁峙县', u'宁武县', u'静乐县', u'神池县', u'五寨县', u'岢岚县', u'河曲县', u'保德县', u'偏关县', u'原平市', u'临汾市', u'市辖区', u'尧都区', u'曲沃县', u'翼城县', u'襄汾县', u'洪洞县', u'古县', u'安泽县', u'浮山县', u'吉县', u'乡宁县', u'大宁县', u'隰县', u'永和县', u'蒲县', u'汾西县', u'侯马市', u'霍州市', u'吕梁市', u'市辖区', u'离石区', u'文水县', u'交城县', u'兴县', u'临县', u'柳林县', u'石楼县', u'岚县', u'方山县', u'中阳县', u'交口县', u'孝义市', u'汾阳市', u'内蒙古自治区', u'呼和浩特市', u'市辖区', u'新城区', u'回民区', u'玉泉区', u'赛罕区', u'土默特左旗', u'托克托县', u'和林格尔县', u'清水河县', u'武川县', u'包头市', u'市辖区', u'东河区', u'昆都仑区', u'青山区', u'石拐区', u'白云鄂博矿区', u'九原区', u'土默特右旗', u'固阳县', u'达尔罕茂明安联合旗', u'乌海市', u'市辖区', u'海勃湾区', u'海南区', u'乌达区', u'赤峰市', u'市辖区', u'红山区', u'元宝山区', u'松山区', u'阿鲁科尔沁旗', u'巴林左旗', u'巴林右旗', u'林西县', u'克什克腾旗', u'翁牛特旗', u'喀喇沁旗', u'宁城县', u'敖汉旗', u'通辽市', u'市辖区', u'科尔沁区', u'科尔沁左翼中旗', u'科尔沁左翼后旗', u'开鲁县', u'库伦旗', u'奈曼旗', u'扎鲁特旗', u'霍林郭勒市', u'鄂尔多斯市', u'市辖区', u'东胜区', u'达拉特旗', u'准格尔旗', u'鄂托克前旗', u'鄂托克旗', u'杭锦旗', u'乌审旗', u'伊金霍洛旗', u'呼伦贝尔市', u'市辖区', u'海拉尔区', u'扎赉诺尔区', u'阿荣旗', u'莫力达瓦达斡尔族自治旗', u'鄂伦春自治旗', u'鄂温克族自治旗', u'陈巴尔虎旗', u'新巴尔虎左旗', u'新巴尔虎右旗', u'满洲里市', u'牙克石市', u'扎兰屯市', u'额尔古纳市', u'根河市', u'巴彦淖尔市', u'市辖区', u'临河区', u'五原县', u'磴口县', u'乌拉特前旗', u'乌拉特中旗', u'乌拉特后旗', u'杭锦后旗', u'乌兰察布市', u'市辖区', u'集宁区', u'卓资县', u'化德县', u'商都县', u'兴和县', u'凉城县', u'察哈尔右翼前旗', u'察哈尔右翼中旗', u'察哈尔右翼后旗', u'四子王旗', u'丰镇市', u'兴安盟', u'乌兰浩特市', u'阿尔山市', u'科尔沁右翼前旗', u'科尔沁右翼中旗', u'扎赉特旗', u'突泉县', u'锡林郭勒盟', u'二连浩特市', u'锡林浩特市', u'阿巴嘎旗', u'苏尼特左旗', u'苏尼特右旗', u'东乌珠穆沁旗', u'西乌珠穆沁旗', u'太仆寺旗', u'镶黄旗', u'正镶白旗', u'正蓝旗', u'多伦县', u'阿拉善盟', u'阿拉善左旗', u'阿拉善右旗', u'额济纳旗', u'辽宁省', u'沈阳市', u'市辖区', u'和平区', u'沈河区', u'大东区', u'皇姑区', u'铁西区', u'苏家屯区', u'东陵区', u'沈北新区', u'于洪区', u'辽中县', u'康平县', u'法库县', u'新民市', u'大连市', u'市辖区', u'中山区', u'西岗区', u'沙河口区', u'甘井子区', u'旅顺口区', u'金州区', u'长海县', u'瓦房店市', u'普兰店市', u'庄河市', u'鞍山市', u'市辖区', u'铁东区', u'铁西区', u'立山区', u'千山区', u'台安县', u'岫岩满族自治县', u'海城市', u'抚顺市', u'市辖区', u'新抚区', u'东洲区', u'望花区', u'顺城区', u'抚顺县', u'新宾满族自治县', u'清原满族自治县', u'本溪市', u'市辖区', u'平山区', u'溪湖区', u'明山区', u'南芬区', u'本溪满族自治县', u'桓仁满族自治县', u'丹东市', u'市辖区', u'元宝区', u'振兴区', u'振安区', u'宽甸满族自治县', u'东港市', u'凤城市', u'锦州市', u'市辖区', u'古塔区', u'凌河区', u'太和区', u'黑山县', u'义县', u'凌海市', u'北镇市', u'营口市', u'市辖区', u'站前区', u'西市区', u'鲅鱼圈区', u'老边区', u'盖州市', u'大石桥市', u'阜新市', u'市辖区', u'海州区', u'新邱区', u'太平区', u'清河门区', u'细河区', u'阜新蒙古族自治县', u'彰武县', u'辽阳市', u'市辖区', u'白塔区', u'文圣区', u'宏伟区', u'弓长岭区', u'太子河区', u'辽阳县', u'灯塔市', u'盘锦市', u'市辖区', u'双台子区', u'兴隆台区', u'大洼县', u'盘山县', u'铁岭市', u'市辖区', u'银州区', u'清河区', u'铁岭县', u'西丰县', u'昌图县', u'调兵山市', u'开原市', u'朝阳市', u'市辖区', u'双塔区', u'龙城区', u'朝阳县', u'建平县', u'喀喇沁左翼蒙古族自治县', u'北票市', u'凌源市', u'葫芦岛市', u'市辖区', u'连山区', u'龙港区', u'南票区', u'绥中县', u'建昌县', u'兴城市', u'吉林省', u'长春市', u'市辖区', u'南关区', u'宽城区', u'朝阳区', u'二道区', u'绿园区', u'双阳区', u'农安县', u'九台市', u'榆树市', u'德惠市', u'吉林市', u'市辖区', u'昌邑区', u'龙潭区', u'船营区', u'丰满区', u'永吉县', u'蛟河市', u'桦甸市', u'舒兰市', u'磐石市', u'四平市', u'市辖区', u'铁西区', u'铁东区', u'梨树县', u'伊通满族自治县', u'公主岭市', u'双辽市', u'辽源市', u'市辖区', u'龙山区', u'西安区', u'东丰县', u'东辽县', u'通化市', u'市辖区', u'东昌区', u'二道江区', u'通化县', u'辉南县', u'柳河县', u'梅河口市', u'集安市', u'白山市', u'市辖区', u'浑江区', u'江源区', u'抚松县', u'靖宇县', u'长白朝鲜族自治县', u'临江市', u'松原市', u'市辖区', u'宁江区', u'前郭尔罗斯蒙古族自治县', u'长岭县', u'乾安县', u'扶余市', u'白城市', u'市辖区', u'洮北区', u'镇赉县', u'通榆县', u'洮南市', u'大安市', u'延边朝鲜族自治州', u'延吉市', u'图们市', u'敦化市', u'珲春市', u'龙井市', u'和龙市', u'汪清县', u'安图县', u'黑龙江省', u'哈尔滨市', u'市辖区', u'道里区', u'南岗区', u'道外区', u'平房区', u'松北区', u'香坊区', u'呼兰区', u'阿城区', u'依兰县', u'方正县', u'宾县', u'巴彦县', u'木兰县', u'通河县', u'延寿县', u'双城市', u'尚志市', u'五常市', u'齐齐哈尔市', u'市辖区', u'龙沙区', u'建华区', u'铁锋区', u'昂昂溪区', u'富拉尔基区', u'碾子山区', u'梅里斯达斡尔族区', u'龙江县', u'依安县', u'泰来县', u'甘南县', u'富裕县', u'克山县', u'克东县', u'拜泉县', u'讷河市', u'鸡西市', u'市辖区', u'鸡冠区', u'恒山区', u'滴道区', u'梨树区', u'城子河区', u'麻山区', u'鸡东县', u'虎林市', u'密山市', u'鹤岗市', u'市辖区', u'向阳区', u'工农区', u'南山区', u'兴安区', u'东山区', u'兴山区', u'萝北县', u'绥滨县', u'双鸭山市', u'市辖区', u'尖山区', u'岭东区', u'四方台区', u'宝山区', u'集贤县', u'友谊县', u'宝清县', u'饶河县', u'大庆市', u'市辖区', u'萨尔图区', u'龙凤区', u'让胡路区', u'红岗区', u'大同区', u'肇州县', u'肇源县', u'林甸县', u'杜尔伯特蒙古族自治县', u'伊春市', u'市辖区', u'伊春区', u'南岔区', u'友好区', u'西林区', u'翠峦区', u'新青区', u'美溪区', u'金山屯区', u'五营区', u'乌马河区', u'汤旺河区', u'带岭区', u'乌伊岭区', u'红星区', u'上甘岭区', u'嘉荫县', u'铁力市', u'佳木斯市', u'市辖区', u'向阳区', u'前进区', u'东风区', u'郊区', u'桦南县', u'桦川县', u'汤原县', u'抚远县', u'同江市', u'富锦市', u'七台河市', u'市辖区', u'新兴区', u'桃山区', u'茄子河区', u'勃利县', u'牡丹江市', u'市辖区', u'东安区', u'阳明区', u'爱民区', u'西安区', u'东宁县', u'林口县', u'绥芬河市', u'海林市', u'宁安市', u'穆棱市', u'黑河市', u'市辖区', u'爱辉区', u'嫩江县', u'逊克县', u'孙吴县', u'北安市', u'五大连池市', u'绥化市', u'市辖区', u'北林区', u'望奎县', u'兰西县', u'青冈县', u'庆安县', u'明水县', u'绥棱县', u'安达市', u'肇东市', u'海伦市', u'大兴安岭地区', u'呼玛县', u'塔河县', u'漠河县', u'上海市', u'市辖区', u'黄浦区', u'徐汇区', u'长宁区', u'静安区', u'普陀区', u'闸北区', u'虹口区', u'杨浦区', u'闵行区', u'宝山区', u'嘉定区', u'浦东新区', u'金山区', u'松江区', u'青浦区', u'奉贤区', u'县', u'崇明县', u'江苏省', u'南京市', u'市辖区', u'玄武区', u'秦淮区', u'建邺区', u'鼓楼区', u'浦口区', u'栖霞区', u'雨花台区', u'江宁区', u'六合区', u'溧水区', u'高淳区', u'无锡市', u'市辖区', u'崇安区', u'南长区', u'北塘区', u'锡山区', u'惠山区', u'滨湖区', u'江阴市', u'宜兴市', u'徐州市', u'市辖区', u'鼓楼区', u'云龙区', u'贾汪区', u'泉山区', u'铜山区', u'丰县', u'沛县', u'睢宁县', u'新沂市', u'邳州市', u'常州市', u'市辖区', u'天宁区', u'钟楼区', u'戚墅堰区', u'新北区', u'武进区', u'溧阳市', u'金坛市', u'苏州市', u'市辖区', u'虎丘区', u'吴中区', u'相城区', u'姑苏区', u'吴江区', u'常熟市', u'张家港市', u'昆山市', u'太仓市', u'南通市', u'市辖区', u'崇川区', u'港闸区', u'通州区', u'海安县', u'如东县', u'启东市', u'如皋市', u'海门市', u'连云港市', u'市辖区', u'连云区', u'新浦区', u'海州区', u'赣榆县', u'东海县', u'灌云县', u'灌南县', u'淮安市', u'市辖区', u'清河区', u'淮安区', u'淮阴区', u'清浦区', u'涟水县', u'洪泽县', u'盱眙县', u'金湖县', u'盐城市', u'市辖区', u'亭湖区', u'盐都区', u'响水县', u'滨海县', u'阜宁县', u'射阳县', u'建湖县', u'东台市', u'大丰市', u'扬州市', u'市辖区', u'广陵区', u'邗江区', u'江都区', u'宝应县', u'仪征市', u'高邮市', u'镇江市', u'市辖区', u'京口区', u'润州区', u'丹徒区', u'丹阳市', u'扬中市', u'句容市', u'泰州市', u'市辖区', u'海陵区', u'高港区', u'姜堰区', u'兴化市', u'靖江市', u'泰兴市', u'宿迁市', u'市辖区', u'宿城区', u'宿豫区', u'沭阳县', u'泗阳县', u'泗洪县', u'浙江省', u'杭州市', u'市辖区', u'上城区', u'下城区', u'江干区', u'拱墅区', u'西湖区', u'滨江区', u'萧山区', u'余杭区', u'桐庐县', u'淳安县', u'建德市', u'富阳市', u'临安市', u'宁波市', u'市辖区', u'海曙区', u'江东区', u'江北区', u'北仑区', u'镇海区', u'鄞州区', u'象山县', u'宁海县', u'余姚市', u'慈溪市', u'奉化市', u'温州市', u'市辖区', u'鹿城区', u'龙湾区', u'瓯海区', u'洞头县', u'永嘉县', u'平阳县', u'苍南县', u'文成县', u'泰顺县', u'瑞安市', u'乐清市', u'嘉兴市', u'市辖区', u'南湖区', u'秀洲区', u'嘉善县', u'海盐县', u'海宁市', u'平湖市', u'桐乡市', u'湖州市', u'市辖区', u'吴兴区', u'南浔区', u'德清县', u'长兴县', u'安吉县', u'绍兴市', u'市辖区', u'越城区', u'绍兴县', u'新昌县', u'诸暨市', u'上虞市', u'嵊州市', u'金华市', u'市辖区', u'婺城区', u'金东区', u'武义县', u'浦江县', u'磐安县', u'兰溪市', u'义乌市', u'东阳市', u'永康市', u'衢州市', u'市辖区', u'柯城区', u'衢江区', u'常山县', u'开化县', u'龙游县', u'江山市', u'舟山市', u'市辖区', u'定海区', u'普陀区', u'岱山县', u'嵊泗县', u'台州市', u'市辖区', u'椒江区', u'黄岩区', u'路桥区', u'玉环县', u'三门县', u'天台县', u'仙居县', u'温岭市', u'临海市', u'丽水市', u'市辖区', u'莲都区', u'青田县', u'缙云县', u'遂昌县', u'松阳县', u'云和县', u'庆元县', u'景宁畲族自治县', u'龙泉市', u'安徽省', u'合肥市', u'市辖区', u'瑶海区', u'庐阳区', u'蜀山区', u'包河区', u'长丰县', u'肥东县', u'肥西县', u'庐江县', u'巢湖市', u'芜湖市', u'市辖区', u'镜湖区', u'弋江区', u'鸠江区', u'三山区', u'芜湖县', u'繁昌县', u'南陵县', u'无为县', u'蚌埠市', u'市辖区', u'龙子湖区', u'蚌山区', u'禹会区', u'淮上区', u'怀远县', u'五河县', u'固镇县', u'淮南市', u'市辖区', u'大通区', u'田家庵区', u'谢家集区', u'八公山区', u'潘集区', u'凤台县', u'马鞍山市', u'市辖区', u'花山区', u'雨山区', u'博望区', u'当涂县', u'含山县', u'和县', u'淮北市', u'市辖区', u'杜集区', u'相山区', u'烈山区', u'濉溪县', u'铜陵市', u'市辖区', u'铜官山区', u'狮子山区', u'郊区', u'铜陵县', u'安庆市', u'市辖区', u'迎江区', u'大观区', u'宜秀区', u'怀宁县', u'枞阳县', u'潜山县', u'太湖县', u'宿松县', u'望江县', u'岳西县', u'桐城市', u'黄山市', u'市辖区', u'屯溪区', u'黄山区', u'徽州区', u'歙县', u'休宁县', u'黟县', u'祁门县', u'滁州市', u'市辖区', u'琅琊区', u'南谯区', u'来安县', u'全椒县', u'定远县', u'凤阳县', u'天长市', u'明光市', u'阜阳市', u'市辖区', u'颍州区', u'颍东区', u'颍泉区', u'临泉县', u'太和县', u'阜南县', u'颍上县', u'界首市', u'宿州市', u'市辖区', u'埇桥区', u'砀山县', u'萧县', u'灵璧县', u'泗县', u'六安市', u'市辖区', u'金安区', u'裕安区', u'寿县', u'霍邱县', u'舒城县', u'金寨县', u'霍山县', u'亳州市', u'市辖区', u'谯城区', u'涡阳县', u'蒙城县', u'利辛县', u'池州市', u'市辖区', u'贵池区', u'东至县', u'石台县', u'青阳县', u'宣城市', u'市辖区', u'宣州区', u'郎溪县', u'广德县', u'泾县', u'绩溪县', u'旌德县', u'宁国市', u'福建省', u'福州市', u'市辖区', u'鼓楼区', u'台江区', u'仓山区', u'马尾区', u'晋安区', u'闽侯县', u'连江县', u'罗源县', u'闽清县', u'永泰县', u'平潭县', u'福清市', u'长乐市', u'厦门市', u'市辖区', u'思明区', u'海沧区', u'湖里区', u'集美区', u'同安区', u'翔安区', u'莆田市', u'市辖区', u'城厢区', u'涵江区', u'荔城区', u'秀屿区', u'仙游县', u'三明市', u'市辖区', u'梅列区', u'三元区', u'明溪县', u'清流县', u'宁化县', u'大田县', u'尤溪县', u'沙县', u'将乐县', u'泰宁县', u'建宁县', u'永安市', u'泉州市', u'市辖区', u'鲤城区', u'丰泽区', u'洛江区', u'泉港区', u'惠安县', u'安溪县', u'永春县', u'德化县', u'金门县', u'石狮市', u'晋江市', u'南安市', u'漳州市', u'市辖区', u'芗城区', u'龙文区', u'云霄县', u'漳浦县', u'诏安县', u'长泰县', u'东山县', u'南靖县', u'平和县', u'华安县', u'龙海市', u'南平市', u'市辖区', u'延平区', u'顺昌县', u'浦城县', u'光泽县', u'松溪县', u'政和县', u'邵武市', u'武夷山市', u'建瓯市', u'建阳市', u'龙岩市', u'市辖区', u'新罗区', u'长汀县', u'永定县', u'上杭县', u'武平县', u'连城县', u'漳平市', u'宁德市', u'市辖区', u'蕉城区', u'霞浦县', u'古田县', u'屏南县', u'寿宁县', u'周宁县', u'柘荣县', u'福安市', u'福鼎市', u'江西省', u'南昌市', u'市辖区', u'东湖区', u'西湖区', u'青云谱区', u'湾里区', u'青山湖区', u'南昌县', u'新建县', u'安义县', u'进贤县', u'景德镇市', u'市辖区', u'昌江区', u'珠山区', u'浮梁县', u'乐平市', u'萍乡市', u'市辖区', u'安源区', u'湘东区', u'莲花县', u'上栗县', u'芦溪县', u'九江市', u'市辖区', u'庐山区', u'浔阳区', u'九江县', u'武宁县', u'修水县', u'永修县', u'德安县', u'星子县', u'都昌县', u'湖口县', u'彭泽县', u'瑞昌市', u'共青城市', u'新余市', u'市辖区', u'渝水区', u'分宜县', u'鹰潭市', u'市辖区', u'月湖区', u'余江县', u'贵溪市', u'赣州市', u'市辖区', u'章贡区', u'赣县', u'信丰县', u'大余县', u'上犹县', u'崇义县', u'安远县', u'龙南县', u'定南县', u'全南县', u'宁都县', u'于都县', u'兴国县', u'会昌县', u'寻乌县', u'石城县', u'瑞金市', u'南康市', u'吉安市', u'市辖区', u'吉州区', u'青原区', u'吉安县', u'吉水县', u'峡江县', u'新干县', u'永丰县', u'泰和县', u'遂川县', u'万安县', u'安福县', u'永新县', u'井冈山市', u'宜春市', u'市辖区', u'袁州区', u'奉新县', u'万载县', u'上高县', u'宜丰县', u'靖安县', u'铜鼓县', u'丰城市', u'樟树市', u'高安市', u'抚州市', u'市辖区', u'临川区', u'南城县', u'黎川县', u'南丰县', u'崇仁县', u'乐安县', u'宜黄县', u'金溪县', u'资溪县', u'东乡县', u'广昌县', u'上饶市', u'市辖区', u'信州区', u'上饶县', u'广丰县', u'玉山县', u'铅山县', u'横峰县', u'弋阳县', u'余干县', u'鄱阳县', u'万年县', u'婺源县', u'德兴市', u'山东省', u'济南市', u'市辖区', u'历下区', u'市中区', u'槐荫区', u'天桥区', u'历城区', u'长清区', u'平阴县', u'济阳县', u'商河县', u'章丘市', u'青岛市', u'市辖区', u'市南区', u'市北区', u'黄岛区', u'崂山区', u'李沧区', u'城阳区', u'胶州市', u'即墨市', u'平度市', u'莱西市', u'淄博市', u'市辖区', u'淄川区', u'张店区', u'博山区', u'临淄区', u'周村区', u'桓台县', u'高青县', u'沂源县', u'枣庄市', u'市辖区', u'市中区', u'薛城区', u'峄城区', u'台儿庄区', u'山亭区', u'滕州市', u'东营市', u'市辖区', u'东营区', u'河口区', u'垦利县', u'利津县', u'广饶县', u'烟台市', u'市辖区', u'芝罘区', u'福山区', u'牟平区', u'莱山区', u'长岛县', u'龙口市', u'莱阳市', u'莱州市', u'蓬莱市', u'招远市', u'栖霞市', u'海阳市', u'潍坊市', u'市辖区', u'潍城区', u'寒亭区', u'坊子区', u'奎文区', u'临朐县', u'昌乐县', u'青州市', u'诸城市', u'寿光市', u'安丘市', u'高密市', u'昌邑市', u'济宁市', u'市辖区', u'市中区', u'任城区', u'微山县', u'鱼台县', u'金乡县', u'嘉祥县', u'汶上县', u'泗水县', u'梁山县', u'曲阜市', u'兖州市', u'邹城市', u'泰安市', u'市辖区', u'泰山区', u'岱岳区', u'宁阳县', u'东平县', u'新泰市', u'肥城市', u'威海市', u'市辖区', u'环翠区', u'文登市', u'荣成市', u'乳山市', u'日照市', u'市辖区', u'东港区', u'岚山区', u'五莲县', u'莒县', u'莱芜市', u'市辖区', u'莱城区', u'钢城区', u'临沂市', u'市辖区', u'兰山区', u'罗庄区', u'河东区', u'沂南县', u'郯城县', u'沂水县', u'苍山县', u'费县', u'平邑县', u'莒南县', u'蒙阴县', u'临沭县', u'德州市', u'市辖区', u'德城区', u'陵县', u'宁津县', u'庆云县', u'临邑县', u'齐河县', u'平原县', u'夏津县', u'武城县', u'乐陵市', u'禹城市', u'聊城市', u'市辖区', u'东昌府区', u'阳谷县', u'莘县', u'茌平县', u'东阿县', u'冠县', u'高唐县', u'临清市', u'滨州市', u'市辖区', u'滨城区', u'惠民县', u'阳信县', u'无棣县', u'沾化县', u'博兴县', u'邹平县', u'菏泽市', u'市辖区', u'牡丹区', u'曹县', u'单县', u'成武县', u'巨野县', u'郓城县', u'鄄城县', u'定陶县', u'东明县', u'河南省', u'郑州市', u'市辖区', u'中原区', u'二七区', u'管城回族区', u'金水区', u'上街区', u'惠济区', u'中牟县', u'巩义市', u'荥阳市', u'新密市', u'新郑市', u'登封市', u'开封市', u'市辖区', u'龙亭区', u'顺河回族区', u'鼓楼区', u'禹王台区', u'金明区', u'杞县', u'通许县', u'尉氏县', u'开封县', u'兰考县', u'洛阳市', u'市辖区', u'老城区', u'西工区', u'瀍河回族区', u'涧西区', u'吉利区', u'洛龙区', u'孟津县', u'新安县', u'栾川县', u'嵩县', u'汝阳县', u'宜阳县', u'洛宁县', u'伊川县', u'偃师市', u'平顶山市', u'市辖区', u'新华区', u'卫东区', u'石龙区', u'湛河区', u'宝丰县', u'叶县', u'鲁山县', u'郏县', u'舞钢市', u'汝州市', u'安阳市', u'市辖区', u'文峰区', u'北关区', u'殷都区', u'龙安区', u'安阳县', u'汤阴县', u'滑县', u'内黄县', u'林州市', u'鹤壁市', u'市辖区', u'鹤山区', u'山城区', u'淇滨区', u'浚县', u'淇县', u'新乡市', u'市辖区', u'红旗区', u'卫滨区', u'凤泉区', u'牧野区', u'新乡县', u'获嘉县', u'原阳县', u'延津县', u'封丘县', u'长垣县', u'卫辉市', u'辉县市', u'焦作市', u'市辖区', u'解放区', u'中站区', u'马村区', u'山阳区', u'修武县', u'博爱县', u'武陟县', u'温县', u'沁阳市', u'孟州市', u'濮阳市', u'市辖区', u'华龙区', u'清丰县', u'南乐县', u'范县', u'台前县', u'濮阳县', u'许昌市', u'市辖区', u'魏都区', u'许昌县', u'鄢陵县', u'襄城县', u'禹州市', u'长葛市', u'漯河市', u'市辖区', u'源汇区', u'郾城区', u'召陵区', u'舞阳县', u'临颍县', u'三门峡市', u'市辖区', u'湖滨区', u'渑池县', u'陕县', u'卢氏县', u'义马市', u'灵宝市', u'南阳市', u'市辖区', u'宛城区', u'卧龙区', u'南召县', u'方城县', u'西峡县', u'镇平县', u'内乡县', u'淅川县', u'社旗县', u'唐河县', u'新野县', u'桐柏县', u'邓州市', u'商丘市', u'市辖区', u'梁园区', u'睢阳区', u'民权县', u'睢县', u'宁陵县', u'柘城县', u'虞城县', u'夏邑县', u'永城市', u'信阳市', u'市辖区', u'浉河区', u'平桥区', u'罗山县', u'光山县', u'新县', u'商城县', u'固始县', u'潢川县', u'淮滨县', u'息县', u'周口市', u'市辖区', u'川汇区', u'扶沟县', u'西华县', u'商水县', u'沈丘县', u'郸城县', u'淮阳县', u'太康县', u'鹿邑县', u'项城市', u'驻马店市', u'市辖区', u'驿城区', u'西平县', u'上蔡县', u'平舆县', u'正阳县', u'确山县', u'泌阳县', u'汝南县', u'遂平县', u'新蔡县', u'省直辖县级行政区划', u'济源市', u'湖北省', u'武汉市', u'市辖区', u'江岸区', u'江汉区', u'硚口区', u'汉阳区', u'武昌区', u'青山区', u'洪山区', u'东西湖区', u'汉南区', u'蔡甸区', u'江夏区', u'黄陂区', u'新洲区', u'黄石市', u'市辖区', u'黄石港区', u'西塞山区', u'下陆区', u'铁山区', u'阳新县', u'大冶市', u'十堰市', u'市辖区', u'茅箭区', u'张湾区', u'郧县', u'郧西县', u'竹山县', u'竹溪县', u'房县', u'丹江口市', u'宜昌市', u'市辖区', u'西陵区', u'伍家岗区', u'点军区', u'猇亭区', u'夷陵区', u'远安县', u'兴山县', u'秭归县', u'长阳土家族自治县', u'五峰土家族自治县', u'宜都市', u'当阳市', u'枝江市', u'襄阳市', u'市辖区', u'襄城区', u'樊城区', u'襄州区', u'南漳县', u'谷城县', u'保康县', u'老河口市', u'枣阳市', u'宜城市', u'鄂州市', u'市辖区', u'梁子湖区', u'华容区', u'鄂城区', u'荆门市', u'市辖区', u'东宝区', u'掇刀区', u'京山县', u'沙洋县', u'钟祥市', u'孝感市', u'市辖区', u'孝南区', u'孝昌县', u'大悟县', u'云梦县', u'应城市', u'安陆市', u'汉川市', u'荆州市', u'市辖区', u'沙市区', u'荆州区', u'公安县', u'监利县', u'江陵县', u'石首市', u'洪湖市', u'松滋市', u'黄冈市', u'市辖区', u'黄州区', u'团风县', u'红安县', u'罗田县', u'英山县', u'浠水县', u'蕲春县', u'黄梅县', u'麻城市', u'武穴市', u'咸宁市', u'市辖区', u'咸安区', u'嘉鱼县', u'通城县', u'崇阳县', u'通山县', u'赤壁市', u'随州市', u'市辖区', u'曾都区', u'随县', u'广水市', u'恩施土家族苗族自治州', u'恩施市', u'利川市', u'建始县', u'巴东县', u'宣恩县', u'咸丰县', u'来凤县', u'鹤峰县', u'省直辖县级行政区划', u'仙桃市', u'潜江市', u'天门市', u'神农架林区', u'湖南省', u'长沙市', u'市辖区', u'芙蓉区', u'天心区', u'岳麓区', u'开福区', u'雨花区', u'望城区', u'长沙县', u'宁乡县', u'浏阳市', u'株洲市', u'市辖区', u'荷塘区', u'芦淞区', u'石峰区', u'天元区', u'株洲县', u'攸县', u'茶陵县', u'炎陵县', u'醴陵市', u'湘潭市', u'市辖区', u'雨湖区', u'岳塘区', u'湘潭县', u'湘乡市', u'韶山市', u'衡阳市', u'市辖区', u'珠晖区', u'雁峰区', u'石鼓区', u'蒸湘区', u'南岳区', u'衡阳县', u'衡南县', u'衡山县', u'衡东县', u'祁东县', u'耒阳市', u'常宁市', u'邵阳市', u'市辖区', u'双清区', u'大祥区', u'北塔区', u'邵东县', u'新邵县', u'邵阳县', u'隆回县', u'洞口县', u'绥宁县', u'新宁县', u'城步苗族自治县', u'武冈市', u'岳阳市', u'市辖区', u'岳阳楼区', u'云溪区', u'君山区', u'岳阳县', u'华容县', u'湘阴县', u'平江县', u'汨罗市', u'临湘市', u'常德市', u'市辖区', u'武陵区', u'鼎城区', u'安乡县', u'汉寿县', u'澧县', u'临澧县', u'桃源县', u'石门县', u'津市市', u'张家界市', u'市辖区', u'永定区', u'武陵源区', u'慈利县', u'桑植县', u'益阳市', u'市辖区', u'资阳区', u'赫山区', u'南县', u'桃江县', u'安化县', u'沅江市', u'郴州市', u'市辖区', u'北湖区', u'苏仙区', u'桂阳县', u'宜章县', u'永兴县', u'嘉禾县', u'临武县', u'汝城县', u'桂东县', u'安仁县', u'资兴市', u'永州市', u'市辖区', u'零陵区', u'冷水滩区', u'祁阳县', u'东安县', u'双牌县', u'道县', u'江永县', u'宁远县', u'蓝山县', u'新田县', u'江华瑶族自治县', u'怀化市', u'市辖区', u'鹤城区', u'中方县', u'沅陵县', u'辰溪县', u'溆浦县', u'会同县', u'麻阳苗族自治县', u'新晃侗族自治县', u'芷江侗族自治县', u'靖州苗族侗族自治县', u'通道侗族自治县', u'洪江市', u'娄底市', u'市辖区', u'娄星区', u'双峰县', u'新化县', u'冷水江市', u'涟源市', u'湘西土家族苗族自治州', u'吉首市', u'泸溪县', u'凤凰县', u'花垣县', u'保靖县', u'古丈县', u'永顺县', u'龙山县', u'广东省', u'广州市', u'市辖区', u'荔湾区', u'越秀区', u'海珠区', u'天河区', u'白云区', u'黄埔区', u'番禺区', u'花都区', u'南沙区', u'萝岗区', u'增城市', u'从化市', u'韶关市', u'市辖区', u'武江区', u'浈江区', u'曲江区', u'始兴县', u'仁化县', u'翁源县', u'乳源瑶族自治县', u'新丰县', u'乐昌市', u'南雄市', u'深圳市', u'市辖区', u'罗湖区', u'福田区', u'南山区', u'宝安区', u'龙岗区', u'盐田区', u'珠海市', u'市辖区', u'香洲区', u'斗门区', u'金湾区', u'汕头市', u'市辖区', u'龙湖区', u'金平区', u'濠江区', u'潮阳区', u'潮南区', u'澄海区', u'南澳县', u'佛山市', u'市辖区', u'禅城区', u'南海区', u'顺德区', u'三水区', u'高明区', u'江门市', u'市辖区', u'蓬江区', u'江海区', u'新会区', u'台山市', u'开平市', u'鹤山市', u'恩平市', u'湛江市', u'市辖区', u'赤坎区', u'霞山区', u'坡头区', u'麻章区', u'遂溪县', u'徐闻县', u'廉江市', u'雷州市', u'吴川市', u'茂名市', u'市辖区', u'茂南区', u'茂港区', u'电白县', u'高州市', u'化州市', u'信宜市', u'肇庆市', u'市辖区', u'端州区', u'鼎湖区', u'广宁县', u'怀集县', u'封开县', u'德庆县', u'高要市', u'四会市', u'惠州市', u'市辖区', u'惠城区', u'惠阳区', u'博罗县', u'惠东县', u'龙门县', u'梅州市', u'市辖区', u'梅江区', u'梅县', u'大埔县', u'丰顺县', u'五华县', u'平远县', u'蕉岭县', u'兴宁市', u'汕尾市', u'市辖区', u'城区', u'海丰县', u'陆河县', u'陆丰市', u'河源市', u'市辖区', u'源城区', u'紫金县', u'龙川县', u'连平县', u'和平县', u'东源县', u'阳江市', u'市辖区', u'江城区', u'阳西县', u'阳东县', u'阳春市', u'清远市', u'市辖区', u'清城区', u'清新区', u'佛冈县', u'阳山县', u'连山壮族瑶族自治县', u'连南瑶族自治县', u'英德市', u'连州市', u'东莞市', u'中山市', u'潮州市', u'市辖区', u'湘桥区', u'潮安区', u'饶平县', u'揭阳市', u'市辖区', u'榕城区', u'揭东区', u'揭西县', u'惠来县', u'普宁市', u'云浮市', u'市辖区', u'云城区', u'新兴县', u'郁南县', u'云安县', u'罗定市', u'广西壮族自治区', u'南宁市', u'市辖区', u'兴宁区', u'青秀区', u'江南区', u'西乡塘区', u'良庆区', u'邕宁区', u'武鸣县', u'隆安县', u'马山县', u'上林县', u'宾阳县', u'横县', u'柳州市', u'市辖区', u'城中区', u'鱼峰区', u'柳南区', u'柳北区', u'柳江县', u'柳城县', u'鹿寨县', u'融安县', u'融水苗族自治县', u'三江侗族自治县', u'桂林市', u'市辖区', u'秀峰区', u'叠彩区', u'象山区', u'七星区', u'雁山区', u'临桂区', u'阳朔县', u'灵川县', u'全州县', u'兴安县', u'永福县', u'灌阳县', u'龙胜各族自治县', u'资源县', u'平乐县', u'荔浦县', u'恭城瑶族自治县', u'梧州市', u'市辖区', u'万秀区', u'长洲区', u'龙圩区', u'苍梧县', u'藤县', u'蒙山县', u'岑溪市', u'北海市', u'市辖区', u'海城区', u'银海区', u'铁山港区', u'合浦县', u'防城港市', u'市辖区', u'港口区', u'防城区', u'上思县', u'东兴市', u'钦州市', u'市辖区', u'钦南区', u'钦北区', u'灵山县', u'浦北县', u'贵港市', u'市辖区', u'港北区', u'港南区', u'覃塘区', u'平南县', u'桂平市', u'玉林市', u'市辖区', u'玉州区', u'福绵区', u'容县', u'陆川县', u'博白县', u'兴业县', u'北流市', u'百色市', u'市辖区', u'右江区', u'田阳县', u'田东县', u'平果县', u'德保县', u'靖西县', u'那坡县', u'凌云县', u'乐业县', u'田林县', u'西林县', u'隆林各族自治县', u'贺州市', u'市辖区', u'八步区', u'昭平县', u'钟山县', u'富川瑶族自治县', u'河池市', u'市辖区', u'金城江区', u'南丹县', u'天峨县', u'凤山县', u'东兰县', u'罗城仫佬族自治县', u'环江毛南族自治县', u'巴马瑶族自治县', u'都安瑶族自治县', u'大化瑶族自治县', u'宜州市', u'来宾市', u'市辖区', u'兴宾区', u'忻城县', u'象州县', u'武宣县', u'金秀瑶族自治县', u'合山市', u'崇左市', u'市辖区', u'江州区', u'扶绥县', u'宁明县', u'龙州县', u'大新县', u'天等县', u'凭祥市', u'海南省', u'海口市', u'市辖区', u'秀英区', u'龙华区', u'琼山区', u'美兰区', u'三亚市', u'市辖区', u'三沙市', u'西沙群岛', u'南沙群岛', u'中沙群岛的岛礁及其海域', u'省直辖县级行政区划', u'五指山市', u'琼海市', u'儋州市', u'文昌市', u'万宁市', u'东方市', u'定安县', u'屯昌县', u'澄迈县', u'临高县', u'白沙黎族自治县', u'昌江黎族自治县', u'乐东黎族自治县', u'陵水黎族自治县', u'保亭黎族苗族自治县', u'琼中黎族苗族自治县', u'重庆市', u'市辖区', u'万州区', u'涪陵区', u'渝中区', u'大渡口区', u'江北区', u'沙坪坝区', u'九龙坡区', u'南岸区', u'北碚区', u'綦江区', u'大足区', u'渝北区', u'巴南区', u'黔江区', u'长寿区', u'江津区', u'合川区', u'永川区', u'南川区', u'县', u'潼南县', u'铜梁县', u'荣昌县', u'璧山县', u'梁平县', u'城口县', u'丰都县', u'垫江县', u'武隆县', u'忠县', u'开县', u'云阳县', u'奉节县', u'巫山县', u'巫溪县', u'石柱土家族自治县', u'秀山土家族苗族自治县', u'酉阳土家族苗族自治县', u'彭水苗族土家族自治县', u'四川省', u'成都市', u'市辖区', u'锦江区', u'青羊区', u'金牛区', u'武侯区', u'成华区', u'龙泉驿区', u'青白江区', u'新都区', u'温江区', u'金堂县', u'双流县', u'郫县', u'大邑县', u'蒲江县', u'新津县', u'都江堰市', u'彭州市', u'邛崃市', u'崇州市', u'自贡市', u'市辖区', u'自流井区', u'贡井区', u'大安区', u'沿滩区', u'荣县', u'富顺县', u'攀枝花市', u'市辖区', u'东区', u'西区', u'仁和区', u'米易县', u'盐边县', u'泸州市', u'市辖区', u'江阳区', u'纳溪区', u'龙马潭区', u'泸县', u'合江县', u'叙永县', u'古蔺县', u'德阳市', u'市辖区', u'旌阳区', u'中江县', u'罗江县', u'广汉市', u'什邡市', u'绵竹市', u'绵阳市', u'市辖区', u'涪城区', u'游仙区', u'三台县', u'盐亭县', u'安县', u'梓潼县', u'北川羌族自治县', u'平武县', u'江油市', u'广元市', u'市辖区', u'利州区', u'元坝区', u'朝天区', u'旺苍县', u'青川县', u'剑阁县', u'苍溪县', u'遂宁市', u'市辖区', u'船山区', u'安居区', u'蓬溪县', u'射洪县', u'大英县', u'内江市', u'市辖区', u'市中区', u'东兴区', u'威远县', u'资中县', u'隆昌县', u'乐山市', u'市辖区', u'市中区', u'沙湾区', u'五通桥区', u'金口河区', u'犍为县', u'井研县', u'夹江县', u'沐川县', u'峨边彝族自治县', u'马边彝族自治县', u'峨眉山市', u'南充市', u'市辖区', u'顺庆区', u'高坪区', u'嘉陵区', u'南部县', u'营山县', u'蓬安县', u'仪陇县', u'西充县', u'阆中市', u'眉山市', u'市辖区', u'东坡区', u'仁寿县', u'彭山县', u'洪雅县', u'丹棱县', u'青神县', u'宜宾市', u'市辖区', u'翠屏区', u'南溪区', u'宜宾县', u'江安县', u'长宁县', u'高县', u'珙县', u'筠连县', u'兴文县', u'屏山县', u'广安市', u'市辖区', u'广安区', u'前锋区', u'岳池县', u'武胜县', u'邻水县', u'华蓥市', u'达州市', u'市辖区', u'通川区', u'达川区', u'宣汉县', u'开江县', u'大竹县', u'渠县', u'万源市', u'雅安市', u'市辖区', u'雨城区', u'名山区', u'荥经县', u'汉源县', u'石棉县', u'天全县', u'芦山县', u'宝兴县', u'巴中市', u'市辖区', u'巴州区', u'恩阳区', u'通江县', u'南江县', u'平昌县', u'资阳市', u'市辖区', u'雁江区', u'安岳县', u'乐至县', u'简阳市', u'阿坝藏族羌族自治州', u'汶川县', u'理县', u'茂县', u'松潘县', u'九寨沟县', u'金川县', u'小金县', u'黑水县', u'马尔康县', u'壤塘县', u'阿坝县', u'若尔盖县', u'红原县', u'甘孜藏族自治州', u'康定县', u'泸定县', u'丹巴县', u'九龙县', u'雅江县', u'道孚县', u'炉霍县', u'甘孜县', u'新龙县', u'德格县', u'白玉县', u'石渠县', u'色达县', u'理塘县', u'巴塘县', u'乡城县', u'稻城县', u'得荣县', u'凉山彝族自治州', u'西昌市', u'木里藏族自治县', u'盐源县', u'德昌县', u'会理县', u'会东县', u'宁南县', u'普格县', u'布拖县', u'金阳县', u'昭觉县', u'喜德县', u'冕宁县', u'越西县', u'甘洛县', u'美姑县', u'雷波县', u'贵州省', u'贵阳市', u'市辖区', u'南明区', u'云岩区', u'花溪区', u'乌当区', u'白云区', u'观山湖区', u'开阳县', u'息烽县', u'修文县', u'清镇市', u'六盘水市', u'钟山区', u'六枝特区', u'水城县', u'盘县', u'遵义市', u'市辖区', u'红花岗区', u'汇川区', u'遵义县', u'桐梓县', u'绥阳县', u'正安县', u'道真仡佬族苗族自治县', u'务川仡佬族苗族自治县', u'凤冈县', u'湄潭县', u'余庆县', u'习水县', u'赤水市', u'仁怀市', u'安顺市', u'市辖区', u'西秀区', u'平坝县', u'普定县', u'镇宁布依族苗族自治县', u'关岭布依族苗族自治县', u'紫云苗族布依族自治县', u'毕节市', u'市辖区', u'七星关区', u'大方县', u'黔西县', u'金沙县', u'织金县', u'纳雍县', u'威宁彝族回族苗族自治县', u'赫章县', u'铜仁市', u'市辖区', u'碧江区', u'万山区', u'江口县', u'玉屏侗族自治县', u'石阡县', u'思南县', u'印江土家族苗族自治县', u'德江县', u'沿河土家族自治县', u'松桃苗族自治县', u'黔西南布依族苗族自治州', u'兴义市', u'兴仁县', u'普安县', u'晴隆县', u'贞丰县', u'望谟县', u'册亨县', u'安龙县', u'黔东南苗族侗族自治州', u'凯里市', u'黄平县', u'施秉县', u'三穗县', u'镇远县', u'岑巩县', u'天柱县', u'锦屏县', u'剑河县', u'台江县', u'黎平县', u'榕江县', u'从江县', u'雷山县', u'麻江县', u'丹寨县', u'黔南布依族苗族自治州', u'都匀市', u'福泉市', u'荔波县', u'贵定县', u'瓮安县', u'独山县', u'平塘县', u'罗甸县', u'长顺县', u'龙里县', u'惠水县', u'三都水族自治县', u'云南省', u'昆明市', u'市辖区', u'五华区', u'盘龙区', u'官渡区', u'西山区', u'东川区', u'呈贡区', u'晋宁县', u'富民县', u'宜良县', u'石林彝族自治县', u'嵩明县', u'禄劝彝族苗族自治县', u'寻甸回族彝族自治县', u'安宁市', u'曲靖市', u'市辖区', u'麒麟区', u'马龙县', u'陆良县', u'师宗县', u'罗平县', u'富源县', u'会泽县', u'沾益县', u'宣威市', u'玉溪市', u'市辖区', u'红塔区', u'江川县', u'澄江县', u'通海县', u'华宁县', u'易门县', u'峨山彝族自治县', u'新平彝族傣族自治县', u'元江哈尼族彝族傣族自治县', u'保山市', u'市辖区', u'隆阳区', u'施甸县', u'腾冲县', u'龙陵县', u'昌宁县', u'昭通市', u'市辖区', u'昭阳区', u'鲁甸县', u'巧家县', u'盐津县', u'大关县', u'永善县', u'绥江县', u'镇雄县', u'彝良县', u'威信县', u'水富县', u'丽江市', u'市辖区', u'古城区', u'玉龙纳西族自治县', u'永胜县', u'华坪县', u'宁蒗彝族自治县', u'普洱市', u'市辖区', u'思茅区', u'宁洱哈尼族彝族自治县', u'墨江哈尼族自治县', u'景东彝族自治县', u'景谷傣族彝族自治县', u'镇沅彝族哈尼族拉祜族自治县', u'江城哈尼族彝族自治县', u'孟连傣族拉祜族佤族自治县', u'澜沧拉祜族自治县', u'西盟佤族自治县', u'临沧市', u'市辖区', u'临翔区', u'凤庆县', u'云县', u'永德县', u'镇康县', u'双江拉祜族佤族布朗族傣族自治县', u'耿马傣族佤族自治县', u'沧源佤族自治县', u'楚雄彝族自治州', u'楚雄市', u'双柏县', u'牟定县', u'南华县', u'姚安县', u'大姚县', u'永仁县', u'元谋县', u'武定县', u'禄丰县', u'红河哈尼族彝族自治州', u'个旧市', u'开远市', u'蒙自市', u'弥勒市', u'屏边苗族自治县', u'建水县', u'石屏县', u'泸西县', u'元阳县', u'红河县', u'金平苗族瑶族傣族自治县', u'绿春县', u'河口瑶族自治县', u'文山壮族苗族自治州', u'文山市', u'砚山县', u'西畴县', u'麻栗坡县', u'马关县', u'丘北县', u'广南县', u'富宁县', u'西双版纳傣族自治州', u'景洪市', u'勐海县', u'勐腊县', u'大理白族自治州', u'大理市', u'漾濞彝族自治县', u'祥云县', u'宾川县', u'弥渡县', u'南涧彝族自治县', u'巍山彝族回族自治县', u'永平县', u'云龙县', u'洱源县', u'剑川县', u'鹤庆县', u'德宏傣族景颇族自治州', u'瑞丽市', u'芒市', u'梁河县', u'盈江县', u'陇川县', u'怒江傈僳族自治州', u'泸水县', u'福贡县', u'贡山独龙族怒族自治县', u'兰坪白族普米族自治县', u'迪庆藏族自治州', u'香格里拉县', u'德钦县', u'维西傈僳族自治县', u'西藏自治区', u'拉萨市', u'市辖区', u'城关区', u'林周县', u'当雄县', u'尼木县', u'曲水县', u'堆龙德庆县', u'达孜县', u'墨竹工卡县', u'昌都地区', u'昌都县', u'江达县', u'贡觉县', u'类乌齐县', u'丁青县', u'察雅县', u'八宿县', u'左贡县', u'芒康县', u'洛隆县', u'边坝县', u'山南地区', u'乃东县', u'扎囊县', u'贡嘎县', u'桑日县', u'琼结县', u'曲松县', u'措美县', u'洛扎县', u'加查县', u'隆子县', u'错那县', u'浪卡子县', u'日喀则地区', u'日喀则市', u'南木林县', u'江孜县', u'定日县', u'萨迦县', u'拉孜县', u'昂仁县', u'谢通门县', u'白朗县', u'仁布县', u'康马县', u'定结县', u'仲巴县', u'亚东县', u'吉隆县', u'聂拉木县', u'萨嘎县', u'岗巴县', u'那曲地区', u'那曲县', u'嘉黎县', u'比如县', u'聂荣县', u'安多县', u'申扎县', u'索县', u'班戈县', u'巴青县', u'尼玛县', u'双湖县', u'阿里地区', u'普兰县', u'札达县', u'噶尔县', u'日土县', u'革吉县', u'改则县', u'措勤县', u'林芝地区', u'林芝县', u'工布江达县', u'米林县', u'墨脱县', u'波密县', u'察隅县', u'朗县', u'陕西省', u'西安市', u'市辖区', u'新城区', u'碑林区', u'莲湖区', u'灞桥区', u'未央区', u'雁塔区', u'阎良区', u'临潼区', u'长安区', u'蓝田县', u'周至县', u'户县', u'高陵县', u'铜川市', u'市辖区', u'王益区', u'印台区', u'耀州区', u'宜君县', u'宝鸡市', u'市辖区', u'渭滨区', u'金台区', u'陈仓区', u'凤翔县', u'岐山县', u'扶风县', u'眉县', u'陇县', u'千阳县', u'麟游县', u'凤县', u'太白县', u'咸阳市', u'市辖区', u'秦都区', u'杨陵区', u'渭城区', u'三原县', u'泾阳县', u'乾县', u'礼泉县', u'永寿县', u'彬县', u'长武县', u'旬邑县', u'淳化县', u'武功县', u'兴平市', u'渭南市', u'市辖区', u'临渭区', u'华县', u'潼关县', u'大荔县', u'合阳县', u'澄城县', u'蒲城县', u'白水县', u'富平县', u'韩城市', u'华阴市', u'延安市', u'市辖区', u'宝塔区', u'延长县', u'延川县', u'子长县', u'安塞县', u'志丹县', u'吴起县', u'甘泉县', u'富县', u'洛川县', u'宜川县', u'黄龙县', u'黄陵县', u'汉中市', u'市辖区', u'汉台区', u'南郑县', u'城固县', u'洋县', u'西乡县', u'勉县', u'宁强县', u'略阳县', u'镇巴县', u'留坝县', u'佛坪县', u'榆林市', u'市辖区', u'榆阳区', u'神木县', u'府谷县', u'横山县', u'靖边县', u'定边县', u'绥德县', u'米脂县', u'佳县', u'吴堡县', u'清涧县', u'子洲县', u'安康市', u'市辖区', u'汉滨区', u'汉阴县', u'石泉县', u'宁陕县', u'紫阳县', u'岚皋县', u'平利县', u'镇坪县', u'旬阳县', u'白河县', u'商洛市', u'市辖区', u'商州区', u'洛南县', u'丹凤县', u'商南县', u'山阳县', u'镇安县', u'柞水县', u'甘肃省', u'兰州市', u'市辖区', u'城关区', u'七里河区', u'西固区', u'安宁区', u'红古区', u'永登县', u'皋兰县', u'榆中县', u'嘉峪关市', u'市辖区', u'金昌市', u'市辖区', u'金川区', u'永昌县', u'白银市', u'市辖区', u'白银区', u'平川区', u'靖远县', u'会宁县', u'景泰县', u'天水市', u'市辖区', u'秦州区', u'麦积区', u'清水县', u'秦安县', u'甘谷县', u'武山县', u'张家川回族自治县', u'武威市', u'市辖区', u'凉州区', u'民勤县', u'古浪县', u'天祝藏族自治县', u'张掖市', u'市辖区', u'甘州区', u'肃南裕固族自治县', u'民乐县', u'临泽县', u'高台县', u'山丹县', u'平凉市', u'市辖区', u'崆峒区', u'泾川县', u'灵台县', u'崇信县', u'华亭县', u'庄浪县', u'静宁县', u'酒泉市', u'市辖区', u'肃州区', u'金塔县', u'瓜州县', u'肃北蒙古族自治县', u'阿克塞哈萨克族自治县', u'玉门市', u'敦煌市', u'庆阳市', u'市辖区', u'西峰区', u'庆城县', u'环县', u'华池县', u'合水县', u'正宁县', u'宁县', u'镇原县', u'定西市', u'市辖区', u'安定区', u'通渭县', u'陇西县', u'渭源县', u'临洮县', u'漳县', u'岷县', u'陇南市', u'市辖区', u'武都区', u'成县', u'文县', u'宕昌县', u'康县', u'西和县', u'礼县', u'徽县', u'两当县', u'临夏回族自治州', u'临夏市', u'临夏县', u'康乐县', u'永靖县', u'广河县', u'和政县', u'东乡族自治县', u'积石山保安族东乡族撒拉族自治县', u'甘南藏族自治州', u'合作市', u'临潭县', u'卓尼县', u'舟曲县', u'迭部县', u'玛曲县', u'碌曲县', u'夏河县', u'青海省', u'西宁市', u'市辖区', u'城东区', u'城中区', u'城西区', u'城北区', u'大通回族土族自治县', u'湟中县', u'湟源县', u'海东市', u'乐都区', u'平安县', u'民和回族土族自治县', u'互助土族自治县', u'化隆回族自治县', u'循化撒拉族自治县', u'海北藏族自治州', u'门源回族自治县', u'祁连县', u'海晏县', u'刚察县', u'黄南藏族自治州', u'同仁县', u'尖扎县', u'泽库县', u'河南蒙古族自治县', u'海南藏族自治州', u'共和县', u'同德县', u'贵德县', u'兴海县', u'贵南县', u'果洛藏族自治州', u'玛沁县', u'班玛县', u'甘德县', u'达日县', u'久治县', u'玛多县', u'玉树藏族自治州', u'玉树市', u'杂多县', u'称多县', u'治多县', u'囊谦县', u'曲麻莱县', u'海西蒙古族藏族自治州', u'格尔木市', u'德令哈市', u'乌兰县', u'都兰县', u'天峻县', u'宁夏回族自治区', u'银川市', u'市辖区', u'兴庆区', u'西夏区', u'金凤区', u'永宁县', u'贺兰县', u'灵武市', u'石嘴山市', u'市辖区', u'大武口区', u'惠农区', u'平罗县', u'吴忠市', u'市辖区', u'利通区', u'红寺堡区', u'盐池县', u'同心县', u'青铜峡市', u'固原市', u'市辖区', u'原州区', u'西吉县', u'隆德县', u'泾源县', u'彭阳县', u'中卫市', u'市辖区', u'沙坡头区', u'中宁县', u'海原县', u'新疆维吾尔自治区', u'乌鲁木齐市', u'市辖区', u'天山区', u'沙依巴克区', u'新市区', u'水磨沟区', u'头屯河区', u'达坂城区', u'米东区', u'乌鲁木齐县', u'克拉玛依市', u'市辖区', u'独山子区', u'克拉玛依区', u'白碱滩区', u'乌尔禾区', u'吐鲁番地区', u'吐鲁番市', u'鄯善县', u'托克逊县', u'哈密地区', u'哈密市', u'巴里坤哈萨克自治县', u'伊吾县', u'昌吉回族自治州', u'昌吉市', u'阜康市', u'呼图壁县', u'玛纳斯县', u'奇台县', u'吉木萨尔县', u'木垒哈萨克自治县', u'博尔塔拉蒙古自治州', u'博乐市', u'阿拉山口市', u'精河县', u'温泉县', u'巴音郭楞蒙古自治州', u'库尔勒市', u'轮台县', u'尉犁县', u'若羌县', u'且末县', u'焉耆回族自治县', u'和静县', u'和硕县', u'博湖县', u'阿克苏地区', u'阿克苏市', u'温宿县', u'库车县', u'沙雅县', u'新和县', u'拜城县', u'乌什县', u'阿瓦提县', u'柯坪县', u'克孜勒苏柯尔克孜自治州', u'阿图什市', u'阿克陶县', u'阿合奇县', u'乌恰县', u'喀什地区', u'喀什市', u'疏附县', u'疏勒县', u'英吉沙县', u'泽普县', u'莎车县', u'叶城县', u'麦盖提县', u'岳普湖县', u'伽师县', u'巴楚县', u'塔什库尔干塔吉克自治县', u'和田地区', u'和田市', u'和田县', u'墨玉县', u'皮山县', u'洛浦县', u'策勒县', u'于田县', u'民丰县', u'伊犁哈萨克自治州', u'伊宁市', u'奎屯市', u'伊宁县', u'察布查尔锡伯自治县', u'霍城县', u'巩留县', u'新源县', u'昭苏县', u'特克斯县', u'尼勒克县', u'塔城地区', u'塔城市', u'乌苏市', u'额敏县', u'沙湾县', u'托里县', u'裕民县', u'和布克赛尔蒙古自治县', u'阿勒泰地区', u'阿勒泰市', u'布尔津县', u'富蕴县', u'福海县', u'哈巴河县', u'青河县', u'吉木乃县', u'自治区直辖县级行政区划', u'石河子市', u'阿拉尔市', u'图木舒克市', u'五家渠市', u'台湾省', u'香港特别行政区', u'澳门特别行政区')

class baseDemo(object):
    """通用基础类，调用返回值，使用等号时判断"""
    def _g(self):
        return None

    def __call__(self, *args, **kwargs):
        return self._g

    def __str__(self):
        r = self._g
        if isinstance(r,(str)):
            return r
        else:
            return str(r)
    __rept__ = __str__

class Int(baseDemo):
    def __init__(self,min_n=2, max_n=10):
        self.min_n, self.max_n = int(min_n), int(max_n)

    def __eq__(self, other):
        return isinstance(other,int) and self.min_n<other<self.max_n

    @property
    def _g(self):
        return randint(self.min_n, self.max_n)

class Float(baseDemo):
    def __init__(self,mins=2, maxs=10, bt=2):
        if str(bt).find('-') !=-1:
            a,b = str(bt).split('-')
            if a>b:
                a,b=b,a
            bt=randint(int(a),int(b))
        self.min_n, self.max_n, self.bt = int(mins), int(maxs), int(bt)

    @property
    def _g(self, ):
        number = random.uniform(self.min_n, self.max_n)
        return round(number, self.bt)

    def __eq__(self, other):
        try:
            other = float(other)
            if not  float(self.min_n) < other < float(self.max_n):
                return False
            text = str(other).split('.')[1]
            return len(text)==self.bt
        except Exception as e:
            print (e)
            return False


class Telephone(baseDemo):
    @property
    def _g(self):
        # 用于随机生成电话号码
        return faker_cn.phone_number()

    def __eq__(self, x):
        tele = str(x)
        if tele[0] !=1:
            return False
        if len(tele)!=11:
            return False
        if not tele.isalnum():
            return False
        return True

class Postcode(baseDemo):
    # 随机生成地区编码
    def __init__(self,location=None):
        self.location=location

    @property
    def _g(self):
        # 用于随机生成政区编码,和地址
        index = randint(1, len(dist_codes))
        code = dist_codes[index]
        if code[4:] == '00':
            return self._g
        return code

    def __eq__(self, x):
        if x in dist_codes:
            return True
        else:
            return False


class Id(baseDemo):
    """
    随机生成一个身份证号，可校验
    """
    def __init__(self,code=None,show_addr=False):
        self.code=code
        self.show_addr=show_addr
        self.weight = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2]  # 权重项
        self.checkcode = {'0': '1', '1': '0', '2': 'X', '3': '9', '4': '8', '5': '7', '6': '6', '7': '5', '8': '5', '9': '3',
                     '10': '2'}
    @property
    def _g(self):
        # 用于随机生成身份证编码
        distcode = Address(self.code,True)()
        id = distcode[1]  # 6位地址码
        id += str(randint(1930, 2017))  # 4位出生年份
        da = date.today() + timedelta(days=randint(1, 366))  # 月份和日期项
        id += da.strftime('%m%d')  # 4位出生日期
        id += str(randint(100, 999))  # 3位顺序号
        # 校验码换算映射
        count=0
        for i,value in enumerate(id):
            count = count + int(value) * self.weight[i]
        id += self.checkcode[str(count % 11)]  # 算出一位校验码
        if self.show_addr:
            return id,distcode[0]
        return id

    def __eq__(self, code):
        # 身份证号校验
        if not code[:6] in dist_codes:
            print ("%s 不属于正确的政区编码" %code[:6] )
            return False
        count = 0
        for i,value in enumerate(code[:-1]):
            count = count + int(value) * self.weight[i]
        result= code[-1]==self.checkcode[str(count % 11)] #比对最后一位校验码
        if not result:
            print("根据校验码规则身份证号应以%s结束" % self.checkcode[str(count % 11)] )
        return result


class Bankcode(baseDemo):
    """
    随机生成一个银联卡好，可校验
    """
    @ property
    def _g(self):
        # 生成银联卡号
        bankc = str(622126 + randint(0, 800))
        bankc += "".join(choice("0123456789") for i in range(choice((9, 12))))
        luhmSum = 0
        for i, value in enumerate(reversed(list(map(int, bankc)))):
            k = value
            if i % 2 == 0:
                k *= 2
                k = k // 10 + k % 10
            luhmSum += k
        if luhmSum % 10 == 0:
            bankc += "0"
        else:
            bankc += str(10 - luhmSum % 10)
        return bankc

    def __eq__(self, other):
        # 银联卡luhmSum算法校验
        digits = [int(x) for x in reversed(str(other))]
        check_sum = sum(digits[::2]) + sum((dig // 10 + dig % 10) for dig in [2 * el for el in digits[1::2]])
        return check_sum % 10 == 0


class Geo_position(baseDemo):
    """
        随机生成有一组经纬度坐标
    """
    def __init__(self,bbox=(115.0, 39.0, 117.0, 41.0)):
        self.bbox = bbox
        self.x = 10
        self.step=0.0000707
        self.direction = randint(0, 360)
        lat_c = map(lambda a:a*self.x,self.bbox[1::2])
        lon_c = map(lambda a:a*self.x,self.bbox[0::2])
        self.lat = Float(*lat_c)()/self.x
        self.lon = Float(*lon_c)()/self.x

    def __call__(self, *args, **kwargs):
        return [self.lon, self.lat]

    def __iter__(self):
        yield self.__next__()

    def __next__(self):
        direction = (self.direction + Float(-90, 90)()) % 360
        direction2=direction/180*math.pi
        self.lat+=self.step*math.cos(direction2)
        self.lon+=self.step*math.sin(direction2)
        return [self.lon, self.lat]

class Province(baseDemo):
    # 随机生成省份
    def __init__(self,code=None,show_code=False):
        self.code=code
        self.show_code=show_code
    @property
    def _g(self):
        if self.code:
            code_filter = list(filter(lambda row: row[:2] == self.code[:2] and row[2:] == '0000', dist_codes))
            if not code_filter:
                code_filter=dist_codes
        else:
            code_filter = list(filter(lambda row: row[2:] == '0000', dist_codes))

        province_code = choice(code_filter)
        province = dist_names[dist_codes.index(province_code)]
        if self.show_code:
            return province,province_code
        else:
            return province

class City(baseDemo):
    # 随机生成省份
    def __init__(self,code=None,show_code=False):
        self.code=code
        self.show_code=show_code

        
    @property
    def _g(self):
        if self.code:
            if self.code in dist_codes and  self.code[2:]=='0000':
                code_filter = filter(lambda row: row[:2] == self.code[:2] and row[4:] == '00' and row[2:] != '0000',
                                     dist_codes)
            elif self.code in dist_codes and self.code[4:] == '00' and self.code[2:]!='0000' :
                code_filter = filter(lambda row: row == self.code, dist_codes)
            elif self.code in dist_codes and self.code[4:] != '00' and self.code[2:]!='0000' :
                code_filter = [self.code[:4]+'00']
            elif self.code[:4]+"00" in dist_codes:
                code_filter = [self.code[:4] + '00']
            else:
                code_filter = filter(lambda row: row[4:] =='00', dist_codes)
        else:
            code_filter = filter(lambda row: row[4:] == '00' and row[2:]!='0000', dist_codes)

        city_code = choice(code_filter)
        city = dist_names[dist_codes.index(city_code)]
        if self.show_code:
            return city,city_code
        else:
            return city

class County(baseDemo):
    # 随机生成三级政区
    def __init__(self,code=None,show_code=False):
        self.code=code
        self.show_code=show_code
    @property
    def _g(self):
        if self.code:
            if self.code in dist_codes and self.code [4:] != '00' and self.code[2:]!='0000':
                code_filter=[self.code]
            elif self.code in dist_codes  and self.code[4:]=='00'and self.code[2:]!='0000' :
                code_filter = filter(lambda row: row[:4] == self.code[:4] and row[4:] != '00',
                                     dist_codes)
            elif self.code[:4]+"00" in dist_codes:
                code_filter = filter(lambda row: row[:4] == self.code[:4] and row[4:] != '00',dist_codes)
            else:
                code_filter = filter(lambda row: row[:2] == self.code[:2] and row[4:] != '00' and row[2:]!='0000', dist_codes)
        else:
            code_filter = filter(lambda row: row[2:] != '0000' and row[4:]!='00', dist_codes)
        county_code = choice(code_filter)
        county = dist_names[dist_codes.index(county_code)]
        if self.show_code:
            return county,county_code
        else:
            return county

class Address(baseDemo):
    """
    随机生成一个联系地址
    """
    def __init__(self,code=None,show_code=False):
        self.code=code
        self.show_code=show_code
    @property
    def _g(self):
        if self.code:
            province = Province(code=self.code,show_code=True)()
            if province[1] in ['710000', '810000', '820000']:
                if self.show_code:
                    return province[0],province[1]
                else:
                    return province[0]
            else:
                city = City(code=self.code, show_code=True)()
                if self.code and  self.code[4:]=='00':
                    county = County(code=self.code , show_code=True)()
                else:
                    county = County(code=self.code, show_code=True)()
                if self.show_code:
                    return u"".join([province[0], city[0], county[0]]),county[1]
                else:
                    return u"".join([province[0],city[0],county[0]])
        else:
            province = Province(show_code=True)()
            if province[1] in ['710000', '810000', '820000']:
                if self.show_code:
                    return province[0],province[1]
                else:
                    return province[0]
            else:
                city = City(code=province[1], show_code=True)()
                county = County(code=city[1], show_code=True)()
                if self.show_code:
                    return u"".join([province[0], city[0], county[0]]),county[1]
                else:
                    return u"".join([province[0],city[0],county[0]])

class Ip(baseDemo):
    """
    随机生成一个IP地址，可校验
    """
    @property
    def _g(self):
        ip = "{}.{}.{}.{}".format(*[randint(1, 255) for i in range(4)])
        return ip

    def __eq__(self, other):
        rex = re.compile("((25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))\.){3}(25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))")
        return bool(re.match(rex,other))


class Email(baseDemo):
    """
    随机生成一个Email地址，可校验
    """
    @property
    def _g(self):
        return faker_cn.email()

    def __eq__(self, other):
        rex = re.compile(u"^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$")
        return bool(re.match(rex,other))

class Domain(baseDemo):
    """
    随机生成一个域名
    """
    @property
    def _g(self):
        return faker_cn.domain_name()

    def __eq__(self, other):
        rex = re.compile(u"^[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$")
        return bool(re.match(rex,other))

class Url(baseDemo):
    @property
    def _g(self):
        return faker_cn.url()

    def __eq__(self, other):
        rex = re.compile(u"^http://[a-zA-Z0-9_-]+(.[a-zA-Z0-9/]+)+")
        return bool(re.match(rex,other))


class Word(baseDemo):
    """
    随机生成一个英文单词
    """
    @property
    def _g(self):
        # 用于生成随机长度字符串
        faker_en.word()



class Paragraph(baseDemo):
    """
    随机生成一段英文
    """
    def __init__(self, nmax=30):
        self.nmax=int(nmax)
    @property
    def _g(self):
        faker_en.text(self.nmax)

class Cword(baseDemo):
    # 随机生成一个汉字
    @property
    def _g(slef):
        faker_cn.word()


class Cparagraph(baseDemo):
    """
    随机生成一段中文
    """
    def __init__(self,nmax=50):
        self.nmax=int(nmax)

    @property
    def _g(self):
        faker_cn.text(self.nmax)

class Cname(baseDemo):
    """
    随机生成一个中文名
    """
    @property
    def _g(self):
        baijia_list = baijia.split(',')
        xing = choice(baijia_list)
        ming = choice(names)
        return u''.join([xing, ming])


class Date(baseDemo):
    """
    随机生成日期
    """
    def __init__(self,strf='%Y-%m-%d'):
        self.strf=strf
    @property
    def _g(self):
        # 随机生成年月日
        year = randint(1990, 2017)  # 四位出生年份
        da = date.today() + timedelta(days=randint(1, 366))  # 月份和日期项
        da.replace(year)
        return da.strftime(self.strf)

class Datetime(baseDemo):
    """
    随机生成日期时间
    """
    def __init__(self,strf='%Y-%m-%d %H:%M:%S'):
        self.strf=strf

    @property
    def _g(self):
        # 随机生成年月日 时分秒
        year = randint(1990, 2018)  # 四位出生年份
        da = datetime.today() + timedelta(days=randint(1, 366))  # 月份和日期项
        da.replace(year)
        return da.strftime(self.strf)

class Randdate(baseDemo):
    """
    随机生成一个有效的日期时间范围
    """
    @property
    def _g(self):
        # 随机生成一组有效时间范围
        year = randint(1990, 2017)
        days = randint(1, 360)
        da = date(1990, 1, 1) + timedelta(days=days)
        da.replace(year)
        date1 = da.strftime('%Y-%m-%d')
        days2 = self.days_tmp(days)
        da2 = date(1990, 1, 1) + timedelta(days=days2)
        da2.replace(year)
        date2 = da2.strftime('%Y-%m-%d')
        return [date1, date2]

    def days_tmp(self,days):
        days2 = days + randint(1, 366)
        if days2 > 365 and (days2 - 365) < days:
            return self.days_tmp(days)
        elif days2 > 365 and (days2 - 365) > days:
            return days2 - 365
        else:
            return days2


def take_data(reg, data):
    """
    从已有数据中提取数据
    :param reg:  数据路径
    :param data:  数据源，dict
    :return: 提取的数据
    """
    text = reg[1:].split(u'.')
    for i in text:
        if isinstance(data, list) and i.isdigit():
            data = data[int(i)]
        elif isinstance(data,dict):
            data = data[i]
        else:
            return None
    return data

def data_associate(data,fromdata={}):
    """
    用于数据生成与关联
    :param data: 元数据数据
    :param fromdata: 关联数据源
    :return: 生成后的数据
    """
    if isinstance(data,list):
        result = []
        for i in data:
            result.append(data_associate(i,fromdata))

    elif isinstance(data,dict):
        result = {}
        for key, value in data.items():
            if isinstance(value,(dict,list)):
                result[key]=data_associate(value,fromdata)

            elif isinstance(value,(str,str)):
                if value:
                    if value.startswith(u'm$'):
                        # 从已有数据中提取
                        result[key]=take_data(value[1:],fromdata)
                    elif value.startswith(u'm@'):
                        # 根据mock规则生成数据
                        reg = re.compile(u"[\(\),@]")
                        args_text = re.split(reg, value)
                        while u"" in args_text:
                            args_text.remove(u"")
                        text=u'%s%s' %(args_text[1][0].upper(),args_text[1][1:])
                        args = args_text[2:]
                        try:
                            method =eval(text)
                            # method = getattr(__builtins__,text,False)
                            result[key]=method(*args)()
                        except:
                            result[key] = value
                    else:
                        result[key]=value
                else:
                    result[key] = value
            else:
                result[key] = value
    else:
        result=None
    return result


# data1= {u"status":{u"测试数据":123123}}
# data2 = {u'status': u'm$status.测试数据',u"time":u"m@datetime('%Y%m%d%H%M%S')",u"result":
#     {u"id":u'm@float(20,30,6-4)',u'name':u'm@cname',u'telephone':u'm@telephone',u"date":u"m@datetime(%Y-%m-%d)",u"ip":u"m@ip",u"title":u"m@cname"}}
#
# print( str(data_associate(data=data2,fromdata=data1)).decode("str_escape"))
if __name__ == '__main__':

    # print (Email())
    # print (Email()())
    # print (Email()==u"xozozxxrl@lktxvpcrjz.pm")
    # print (Email()==Email()())
    # print Url()()
    # print ""
    # print Address()()
    print(Address('371521'))
    # print Address('431100')()
    # print Address('431102')()
    # print Province('431111')()
    # print City('431111')()
    # print County('431111')()
    #
    a =  Id('371521',show_addr = True)()
    print(a[0],a[1])
    # # a =  Id('500103',show_addr = True)()
    # print a[0],a[1]
    #
    # for i in range(10):
    #     a =  Id(show_addr = True)()
    #     print Cname()(),a[0],a[1]
    #
    #
    # print Id()=="220283199001287431"
    # print Id()=="320911194604146347"
    # print Id()=="320921196312083073"
    #
    # a =  Id('320921',show_addr = True)()
    # print a[0],a[1]
    # a =  Id(show_addr = True)()
    # print a[0],a[1]